7767517
373 423
Input                    in0                      0 1 in0
Permute                  transpose_270            1 1 in0 1 0=1
Padding                  zeropad_224              1 1 1 2 0=0 1=1 2=0 3=1 4=0 5=0.000000e+00
Convolution              conv_55                  1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=288
Swish                    silu_155                 1 1 3 4
ConvolutionDepthWise     convdw_276               1 1 4 5 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Swish                    silu_156                 1 1 5 6
Split                    splitncnn_0              1 2 6 7 8
Pooling                  gap_0                    1 1 8 9 0=1 4=1
Convolution              conv_56                  1 1 9 10 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Swish                    silu_157                 1 1 10 11
Convolution              convsigmoid_0            1 1 11 12 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 9=4
Reshape                  reshape_226              1 1 12 13 0=1 1=1 2=-1
BinaryOp                 mul_0                    2 1 13 7 14 0=2
Convolution              conv_58                  1 1 14 15 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Split                    splitncnn_1              1 2 15 16 17
ConvolutionDepthWise     convdw_277               1 1 17 18 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16
Swish                    silu_158                 1 1 18 19
Split                    splitncnn_2              1 2 19 20 21
Pooling                  gap_1                    1 1 21 22 0=1 4=1
Convolution              conv_59                  1 1 22 23 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Swish                    silu_159                 1 1 23 24
Convolution              convsigmoid_1            1 1 24 25 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
Reshape                  reshape_227              1 1 25 26 0=1 1=1 2=-1
BinaryOp                 mul_1                    2 1 26 20 27 0=2
Convolution              conv_61                  1 1 27 28 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
BinaryOp                 add_2                    2 1 28 16 29 0=0
Convolution              conv_62                  1 1 29 30 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_160                 1 1 30 31
Padding                  zeropad_225              1 1 31 32 0=0 1=1 2=0 3=1 4=0 5=0.000000e+00
ConvolutionDepthWise     convdw_278               1 1 32 33 0=96 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=864 7=96
Swish                    silu_161                 1 1 33 34
Split                    splitncnn_3              1 2 34 35 36
Pooling                  gap_2                    1 1 36 37 0=1 4=1
Convolution              conv_63                  1 1 37 38 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Swish                    silu_162                 1 1 38 39
Convolution              convsigmoid_2            1 1 39 40 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384 9=4
Reshape                  reshape_228              1 1 40 41 0=1 1=1 2=-1
BinaryOp                 mul_3                    2 1 41 35 42 0=2
Convolution              conv_65                  1 1 42 43 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Split                    splitncnn_4              1 2 43 44 45
Convolution              conv_66                  1 1 45 46 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Swish                    silu_163                 1 1 46 47
ConvolutionDepthWise     convdw_279               1 1 47 48 0=144 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1296 7=144
Swish                    silu_164                 1 1 48 49
Split                    splitncnn_5              1 2 49 50 51
Pooling                  gap_3                    1 1 51 52 0=1 4=1
Convolution              conv_67                  1 1 52 53 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=864
Swish                    silu_165                 1 1 53 54
Convolution              convsigmoid_3            1 1 54 55 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=864 9=4
Reshape                  reshape_229              1 1 55 56 0=1 1=1 2=-1
BinaryOp                 mul_4                    2 1 56 50 57 0=2
Convolution              conv_69                  1 1 57 58 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
BinaryOp                 add_5                    2 1 58 44 59 0=0
Split                    splitncnn_6              1 2 59 60 61
Convolution              conv_70                  1 1 61 62 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Swish                    silu_166                 1 1 62 63
ConvolutionDepthWise     convdw_280               1 1 63 64 0=144 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1296 7=144
Swish                    silu_167                 1 1 64 65
Split                    splitncnn_7              1 2 65 66 67
Pooling                  gap_4                    1 1 67 68 0=1 4=1
Convolution              conv_71                  1 1 68 69 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=864
Swish                    silu_168                 1 1 69 70
Convolution              convsigmoid_4            1 1 70 71 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=864 9=4
Reshape                  reshape_230              1 1 71 72 0=1 1=1 2=-1
BinaryOp                 mul_6                    2 1 72 66 73 0=2
Convolution              conv_73                  1 1 73 74 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
BinaryOp                 add_7                    2 1 74 60 75 0=0
Convolution              conv_74                  1 1 75 76 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Swish                    silu_169                 1 1 76 77
ConvolutionDepthWise     convdw_281               1 1 77 78 0=144 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=3600 7=144
Swish                    silu_170                 1 1 78 79
Split                    splitncnn_8              1 2 79 80 81
Pooling                  gap_5                    1 1 81 82 0=1 4=1
Convolution              conv_75                  1 1 82 83 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=864
Swish                    silu_171                 1 1 83 84
Convolution              convsigmoid_5            1 1 84 85 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=864 9=4
Reshape                  reshape_231              1 1 85 86 0=1 1=1 2=-1
BinaryOp                 mul_8                    2 1 86 80 87 0=2
Convolution              conv_77                  1 1 87 88 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6912
Split                    splitncnn_9              1 2 88 89 90
Convolution              conv_78                  1 1 90 91 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
Swish                    silu_172                 1 1 91 92
ConvolutionDepthWise     convdw_282               1 1 92 93 0=288 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=7200 7=288
Swish                    silu_173                 1 1 93 94
Split                    splitncnn_10             1 2 94 95 96
Pooling                  gap_6                    1 1 96 97 0=1 4=1
Convolution              conv_79                  1 1 97 98 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Swish                    silu_174                 1 1 98 99
Convolution              convsigmoid_6            1 1 99 100 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=4
Reshape                  reshape_232              1 1 100 101 0=1 1=1 2=-1
BinaryOp                 mul_9                    2 1 101 95 102 0=2
Convolution              conv_81                  1 1 102 103 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
BinaryOp                 add_10                   2 1 103 89 104 0=0
Split                    splitncnn_11             1 2 104 105 106
Convolution              conv_82                  1 1 106 107 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
Swish                    silu_175                 1 1 107 108
ConvolutionDepthWise     convdw_283               1 1 108 109 0=288 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=7200 7=288
Swish                    silu_176                 1 1 109 110
Split                    splitncnn_12             1 2 110 111 112
Pooling                  gap_7                    1 1 112 113 0=1 4=1
Convolution              conv_83                  1 1 113 114 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Swish                    silu_177                 1 1 114 115
Convolution              convsigmoid_7            1 1 115 116 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=4
Reshape                  reshape_233              1 1 116 117 0=1 1=1 2=-1
BinaryOp                 mul_11                   2 1 117 111 118 0=2
Convolution              conv_85                  1 1 118 119 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
BinaryOp                 add_12                   2 1 119 105 120 0=0
Convolution              conv_86                  1 1 120 121 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
Swish                    silu_178                 1 1 121 122
ConvolutionDepthWise     convdw_284               1 1 122 123 0=288 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2592 7=288
Swish                    silu_179                 1 1 123 124
Split                    splitncnn_13             1 2 124 125 126
Pooling                  gap_8                    1 1 126 127 0=1 4=1
Convolution              conv_87                  1 1 127 128 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Swish                    silu_180                 1 1 128 129
Convolution              convsigmoid_8            1 1 129 130 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=4
Reshape                  reshape_234              1 1 130 131 0=1 1=1 2=-1
BinaryOp                 mul_13                   2 1 131 125 132 0=2
Convolution              conv_89                  1 1 132 133 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25344
Split                    splitncnn_14             1 2 133 134 135
Convolution              conv_90                  1 1 135 136 0=528 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=46464
Swish                    silu_181                 1 1 136 137
ConvolutionDepthWise     convdw_285               1 1 137 138 0=528 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4752 7=528
Swish                    silu_182                 1 1 138 139
Split                    splitncnn_15             1 2 139 140 141
Pooling                  gap_9                    1 1 141 142 0=1 4=1
Convolution              conv_91                  1 1 142 143 0=22 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=11616
Swish                    silu_183                 1 1 143 144
Convolution              convsigmoid_9            1 1 144 145 0=528 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=11616 9=4
Reshape                  reshape_235              1 1 145 146 0=1 1=1 2=-1
BinaryOp                 mul_14                   2 1 146 140 147 0=2
Convolution              conv_93                  1 1 147 148 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=46464
BinaryOp                 add_15                   2 1 148 134 149 0=0
Split                    splitncnn_16             1 2 149 150 151
Convolution              conv_94                  1 1 151 152 0=528 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=46464
Swish                    silu_184                 1 1 152 153
ConvolutionDepthWise     convdw_286               1 1 153 154 0=528 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4752 7=528
Swish                    silu_185                 1 1 154 155
Split                    splitncnn_17             1 2 155 156 157
Pooling                  gap_10                   1 1 157 158 0=1 4=1
Convolution              conv_95                  1 1 158 159 0=22 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=11616
Swish                    silu_186                 1 1 159 160
Convolution              convsigmoid_10           1 1 160 161 0=528 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=11616 9=4
Reshape                  reshape_236              1 1 161 162 0=1 1=1 2=-1
BinaryOp                 mul_16                   2 1 162 156 163 0=2
Convolution              conv_97                  1 1 163 164 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=46464
BinaryOp                 add_17                   2 1 164 150 165 0=0
Split                    splitncnn_18             1 2 165 166 167
Convolution              conv_98                  1 1 167 168 0=528 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=46464
Swish                    silu_187                 1 1 168 169
ConvolutionDepthWise     convdw_287               1 1 169 170 0=528 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4752 7=528
Swish                    silu_188                 1 1 170 171
Split                    splitncnn_19             1 2 171 172 173
Pooling                  gap_11                   1 1 173 174 0=1 4=1
Convolution              conv_99                  1 1 174 175 0=22 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=11616
Swish                    silu_189                 1 1 175 176
Convolution              convsigmoid_11           1 1 176 177 0=528 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=11616 9=4
Reshape                  reshape_237              1 1 177 178 0=1 1=1 2=-1
BinaryOp                 mul_18                   2 1 178 172 179 0=2
Convolution              conv_101                 1 1 179 180 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=46464
BinaryOp                 add_19                   2 1 180 166 181 0=0
Convolution              conv_102                 1 1 181 182 0=528 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=46464
Swish                    silu_190                 1 1 182 183
ConvolutionDepthWise     convdw_288               1 1 183 184 0=528 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=13200 7=528
Swish                    silu_191                 1 1 184 185
Split                    splitncnn_20             1 2 185 186 187
Pooling                  gap_12                   1 1 187 188 0=1 4=1
Convolution              conv_103                 1 1 188 189 0=22 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=11616
Swish                    silu_192                 1 1 189 190
Convolution              convsigmoid_12           1 1 190 191 0=528 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=11616 9=4
Reshape                  reshape_238              1 1 191 192 0=1 1=1 2=-1
BinaryOp                 mul_20                   2 1 192 186 193 0=2
Convolution              conv_105                 1 1 193 194 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=63360
Split                    splitncnn_21             1 2 194 195 196
Convolution              conv_106                 1 1 196 197 0=720 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=86400
Swish                    silu_193                 1 1 197 198
ConvolutionDepthWise     convdw_289               1 1 198 199 0=720 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=18000 7=720
Swish                    silu_194                 1 1 199 200
Split                    splitncnn_22             1 2 200 201 202
Pooling                  gap_13                   1 1 202 203 0=1 4=1
Convolution              conv_107                 1 1 203 204 0=30 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=21600
Swish                    silu_195                 1 1 204 205
Convolution              convsigmoid_13           1 1 205 206 0=720 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=21600 9=4
Reshape                  reshape_239              1 1 206 207 0=1 1=1 2=-1
BinaryOp                 mul_21                   2 1 207 201 208 0=2
Convolution              conv_109                 1 1 208 209 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=86400
BinaryOp                 add_22                   2 1 209 195 210 0=0
Split                    splitncnn_23             1 2 210 211 212
Convolution              conv_110                 1 1 212 213 0=720 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=86400
Swish                    silu_196                 1 1 213 214
ConvolutionDepthWise     convdw_290               1 1 214 215 0=720 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=18000 7=720
Swish                    silu_197                 1 1 215 216
Split                    splitncnn_24             1 2 216 217 218
Pooling                  gap_14                   1 1 218 219 0=1 4=1
Convolution              conv_111                 1 1 219 220 0=30 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=21600
Swish                    silu_198                 1 1 220 221
Convolution              convsigmoid_14           1 1 221 222 0=720 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=21600 9=4
Reshape                  reshape_240              1 1 222 223 0=1 1=1 2=-1
BinaryOp                 mul_23                   2 1 223 217 224 0=2
Convolution              conv_113                 1 1 224 225 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=86400
BinaryOp                 add_24                   2 1 225 211 226 0=0
Split                    splitncnn_25             1 2 226 227 228
Convolution              conv_114                 1 1 228 229 0=720 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=86400
Swish                    silu_199                 1 1 229 230
ConvolutionDepthWise     convdw_291               1 1 230 231 0=720 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=18000 7=720
Swish                    silu_200                 1 1 231 232
Split                    splitncnn_26             1 2 232 233 234
Pooling                  gap_15                   1 1 234 235 0=1 4=1
Convolution              conv_115                 1 1 235 236 0=30 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=21600
Swish                    silu_201                 1 1 236 237
Convolution              convsigmoid_15           1 1 237 238 0=720 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=21600 9=4
Reshape                  reshape_241              1 1 238 239 0=1 1=1 2=-1
BinaryOp                 mul_25                   2 1 239 233 240 0=2
Convolution              conv_117                 1 1 240 241 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=86400
BinaryOp                 add_26                   2 1 241 227 242 0=0
Convolution              conv_118                 1 1 242 243 0=720 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=86400
Swish                    silu_202                 1 1 243 244
ConvolutionDepthWise     convdw_292               1 1 244 245 0=720 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=18000 7=720
Swish                    silu_203                 1 1 245 246
Split                    splitncnn_27             1 2 246 247 248
Pooling                  gap_16                   1 1 248 249 0=1 4=1
Convolution              conv_119                 1 1 249 250 0=30 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=21600
Swish                    silu_204                 1 1 250 251
Convolution              convsigmoid_16           1 1 251 252 0=720 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=21600 9=4
Reshape                  reshape_242              1 1 252 253 0=1 1=1 2=-1
BinaryOp                 mul_27                   2 1 253 247 254 0=2
Convolution              conv_121                 1 1 254 255 0=208 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=149760
Split                    splitncnn_28             1 2 255 256 257
Convolution              conv_122                 1 1 257 258 0=1248 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259584
Swish                    silu_205                 1 1 258 259
ConvolutionDepthWise     convdw_293               1 1 259 260 0=1248 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=31200 7=1248
Swish                    silu_206                 1 1 260 261
Split                    splitncnn_29             1 2 261 262 263
Pooling                  gap_17                   1 1 263 264 0=1 4=1
Convolution              conv_123                 1 1 264 265 0=52 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64896
Swish                    silu_207                 1 1 265 266
Convolution              convsigmoid_17           1 1 266 267 0=1248 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64896 9=4
Reshape                  reshape_243              1 1 267 268 0=1 1=1 2=-1
BinaryOp                 mul_28                   2 1 268 262 269 0=2
Convolution              conv_125                 1 1 269 270 0=208 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259584
BinaryOp                 add_29                   2 1 270 256 271 0=0
Split                    splitncnn_30             1 2 271 272 273
Convolution              conv_126                 1 1 273 274 0=1248 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259584
Swish                    silu_208                 1 1 274 275
ConvolutionDepthWise     convdw_294               1 1 275 276 0=1248 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=31200 7=1248
Swish                    silu_209                 1 1 276 277
Split                    splitncnn_31             1 2 277 278 279
Pooling                  gap_18                   1 1 279 280 0=1 4=1
Convolution              conv_127                 1 1 280 281 0=52 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64896
Swish                    silu_210                 1 1 281 282
Convolution              convsigmoid_18           1 1 282 283 0=1248 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64896 9=4
Reshape                  reshape_244              1 1 283 284 0=1 1=1 2=-1
BinaryOp                 mul_30                   2 1 284 278 285 0=2
Convolution              conv_129                 1 1 285 286 0=208 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259584
BinaryOp                 add_31                   2 1 286 272 287 0=0
Split                    splitncnn_32             1 2 287 288 289
Convolution              conv_130                 1 1 289 290 0=1248 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259584
Swish                    silu_211                 1 1 290 291
ConvolutionDepthWise     convdw_295               1 1 291 292 0=1248 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=31200 7=1248
Swish                    silu_212                 1 1 292 293
Split                    splitncnn_33             1 2 293 294 295
Pooling                  gap_19                   1 1 295 296 0=1 4=1
Convolution              conv_131                 1 1 296 297 0=52 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64896
Swish                    silu_213                 1 1 297 298
Convolution              convsigmoid_19           1 1 298 299 0=1248 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64896 9=4
Reshape                  reshape_245              1 1 299 300 0=1 1=1 2=-1
BinaryOp                 mul_32                   2 1 300 294 301 0=2
Convolution              conv_133                 1 1 301 302 0=208 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259584
BinaryOp                 add_33                   2 1 302 288 303 0=0
Split                    splitncnn_34             1 2 303 304 305
Convolution              conv_134                 1 1 305 306 0=1248 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259584
Swish                    silu_214                 1 1 306 307
ConvolutionDepthWise     convdw_296               1 1 307 308 0=1248 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=31200 7=1248
Swish                    silu_215                 1 1 308 309
Split                    splitncnn_35             1 2 309 310 311
Pooling                  gap_20                   1 1 311 312 0=1 4=1
Convolution              conv_135                 1 1 312 313 0=52 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64896
Swish                    silu_216                 1 1 313 314
Convolution              convsigmoid_20           1 1 314 315 0=1248 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64896 9=4
Reshape                  reshape_246              1 1 315 316 0=1 1=1 2=-1
BinaryOp                 mul_34                   2 1 316 310 317 0=2
Convolution              conv_137                 1 1 317 318 0=208 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259584
BinaryOp                 add_35                   2 1 318 304 319 0=0
Convolution              conv_138                 1 1 319 320 0=1248 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259584
Swish                    silu_217                 1 1 320 321
ConvolutionDepthWise     convdw_297               1 1 321 322 0=1248 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=11232 7=1248
Swish                    silu_218                 1 1 322 323
Split                    splitncnn_36             1 2 323 324 325
Pooling                  gap_21                   1 1 325 326 0=1 4=1
Convolution              conv_139                 1 1 326 327 0=52 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64896
Swish                    silu_219                 1 1 327 328
Convolution              convsigmoid_21           1 1 328 329 0=1248 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64896 9=4
Reshape                  reshape_247              1 1 329 330 0=1 1=1 2=-1
BinaryOp                 mul_36                   2 1 330 324 331 0=2
Convolution              conv_141                 1 1 331 332 0=352 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=439296
Split                    splitncnn_37             1 2 332 333 334
Convolution              conv_142                 1 1 334 335 0=2112 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=743424
Swish                    silu_220                 1 1 335 336
ConvolutionDepthWise     convdw_298               1 1 336 337 0=2112 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=19008 7=2112
Swish                    silu_221                 1 1 337 338
Split                    splitncnn_38             1 2 338 339 340
Pooling                  gap_22                   1 1 340 341 0=1 4=1
Convolution              conv_143                 1 1 341 342 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=185856
Swish                    silu_222                 1 1 342 343
Convolution              convsigmoid_22           1 1 343 344 0=2112 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=185856 9=4
Reshape                  reshape_248              1 1 344 345 0=1 1=1 2=-1
BinaryOp                 mul_37                   2 1 345 339 346 0=2
Convolution              conv_145                 1 1 346 347 0=352 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=743424
BinaryOp                 add_38                   2 1 347 333 348 0=0
Convolution              conv_146                 1 1 348 349 0=1408 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=495616
Swish                    silu_223                 1 1 349 350
Pooling                  avgpool2d_54             1 1 350 351 0=1 1=1 11=4 12=4 13=0 2=1 3=0 5=1 6=1
Permute                  transpose_271            1 1 351 352 0=1
Split                    splitncnn_39             1 8 352 353 354 355 356 357 358 359 360
Convolution              convsigmoid_23           1 1 360 361 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8448 9=4
Slice                    unbind_0                 1 1 361 362 -23300=1,-233 1=2
Reshape                  reshape_249              1 1 362 363 0=16 1=6
Clip                     clamp_257                1 1 363 364 0=1.000000e-07 1=9.999999e-01
Split                    splitncnn_40             1 2 364 365 366
Reduction                sum_261                  1 1 366 367 0=0 1=0 -23303=1,1 4=0 5=1
Convolution              convsigmoid_24           1 1 359 368 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8448 9=4
Slice                    unbind_1                 1 1 368 369 -23300=1,-233 1=2
ExpandDims               unsqueeze_272            1 1 367 370 -23303=1,1
BinaryOp                 div_39                   2 1 365 370 371 0=3
Reshape                  reshape_250              1 1 369 372 0=16 1=6
BinaryOp                 mul_40                   2 1 371 372 373 0=2
Reduction                sum_262                  1 1 373 374 0=0 1=0 -23303=1,1 4=0 5=1
BinaryOp                 mul_41                   1 1 374 375 0=2 1=1 2=5.921604e-01
Convolution              convsigmoid_25           1 1 358 376 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8448 9=4
Slice                    unbind_2                 1 1 376 377 -23300=1,-233 1=2
Reshape                  reshape_251              1 1 377 378 0=16 1=6
Clip                     clamp_258                1 1 378 379 0=1.000000e-07 1=9.999999e-01
Split                    splitncnn_41             1 2 379 380 381
Reduction                sum_263                  1 1 381 382 0=0 1=0 -23303=1,1 4=0 5=1
Convolution              convsigmoid_26           1 1 357 383 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8448 9=4
Slice                    unbind_3                 1 1 383 384 -23300=1,-233 1=2
ExpandDims               unsqueeze_273            1 1 382 385 -23303=1,1
BinaryOp                 div_42                   2 1 380 385 386 0=3
Reshape                  reshape_252              1 1 384 387 0=16 1=6
BinaryOp                 mul_43                   2 1 386 387 388 0=2
Reduction                sum_264                  1 1 388 389 0=0 1=0 -23303=1,1 4=0 5=1
BinaryOp                 mul_44                   1 1 389 390 0=2 1=1 2=5.930342e-01
Convolution              convsigmoid_27           1 1 356 391 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8448 9=4
Slice                    unbind_4                 1 1 391 392 -23300=1,-233 1=2
Reshape                  reshape_253              1 1 392 393 0=16 1=6
Clip                     clamp_259                1 1 393 394 0=1.000000e-07 1=9.999999e-01
Split                    splitncnn_42             1 2 394 395 396
Reduction                sum_265                  1 1 396 397 0=0 1=0 -23303=1,1 4=0 5=1
Convolution              convsigmoid_28           1 1 355 398 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8448 9=4
Slice                    unbind_5                 1 1 398 399 -23300=1,-233 1=2
ExpandDims               unsqueeze_274            1 1 397 400 -23303=1,1
BinaryOp                 div_45                   2 1 395 400 401 0=3
Reshape                  reshape_254              1 1 399 402 0=16 1=6
BinaryOp                 mul_46                   2 1 401 402 403 0=2
Reduction                sum_266                  1 1 403 404 0=0 1=0 -23303=1,1 4=0 5=1
BinaryOp                 mul_47                   1 1 404 405 0=2 1=1 2=6.005406e-01
Convolution              convsigmoid_29           1 1 354 406 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8448 9=4
Slice                    unbind_6                 1 1 406 407 -23300=1,-233 1=2
Reshape                  reshape_255              1 1 407 408 0=16 1=6
Clip                     clamp_260                1 1 408 409 0=1.000000e-07 1=9.999999e-01
Split                    splitncnn_43             1 2 409 410 411
Reduction                sum_267                  1 1 411 412 0=0 1=0 -23303=1,1 4=0 5=1
Convolution              convsigmoid_30           1 1 353 413 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8448 9=4
Slice                    unbind_7                 1 1 413 414 -23300=1,-233 1=2
ExpandDims               unsqueeze_275            1 1 412 415 -23303=1,1
BinaryOp                 div_48                   2 1 410 415 416 0=3
Reshape                  reshape_256              1 1 414 417 0=16 1=6
BinaryOp                 mul_49                   2 1 416 417 418 0=2
Reduction                sum_268                  1 1 418 419 0=0 1=0 -23303=1,1 4=0 5=1
BinaryOp                 mul_50                   1 1 419 420 0=2 1=1 2=5.926947e-01
Concat                   stack_0                  4 1 375 390 405 420 421
Reduction                sum_269                  1 1 421 out0 0=0 1=0 -23303=0 4=0 5=1
