7767517
2202 2201
pnnx.Input               pnnx_input_0             0 1 x.3 #x.3=(1,1,500,128)f32
prim::Constant           pnnx_0                   0 1 165 value=2
prim::Constant           pnnx_1                   0 1 166 value=3
prim::Constant           pnnx_5                   0 1 257 value=None
prim::Constant           pnnx_6                   0 1 258 value=2
prim::Constant           pnnx_7                   0 1 259 value=0
prim::Constant           pnnx_8                   0 1 260 value=1
pnnx.Attribute           effnet._conv_stem        0 1 weight.3 @data=(32,1,3,3)f32 #weight.3=(32,1,3,3)f32
torch.transpose          torch.transpose_227      3 1 x.3 165 166 input.3 $input=x.3 $dim0=165 $dim1=166 #x.3=(1,1,500,128)f32 #input.3=(1,1,128,500)f32
nn.ZeroPad2d             effnet._conv_stem.static_padding 1 1 input.3 263 padding=(0,1,0,1) #input.3=(1,1,128,500)f32 #263=(1,1,129,501)f32
prim::Constant           pnnx_9                   0 1 2372 value=2
prim::ListConstruct      pnnx_10                  2 1 258 2372 264
prim::Constant           pnnx_11                  0 1 2373 value=0
prim::ListConstruct      pnnx_12                  2 1 259 2373 265
prim::Constant           pnnx_13                  0 1 2374 value=1
prim::ListConstruct      pnnx_14                  2 1 260 2374 266
prim::Constant           pnnx_18                  0 1 2377 value=1
F.conv2d                 F.conv2d_23              7 1 263 weight.3 257 264 265 266 2377 input0.1 $input=263 $weight=weight.3 $bias=257 $stride=264 $padding=265 $dilation=266 $groups=2377 #263=(1,1,129,501)f32 #weight.3=(32,1,3,3)f32 #input0.1=(1,32,64,250)f32
nn.BatchNorm2d           effnet._bn0              1 1 input0.1 172 affine=True eps=1.000000e-03 num_features=32 @bias=(32)f32 @running_mean=(32)f32 @running_var=(32)f32 @weight=(32)f32 #input0.1=(1,32,64,250)f32 #172=(1,32,64,250)f32
nn.SiLU                  effnet._swish            1 1 172 176 #172=(1,32,64,250)f32 #176=(1,32,64,250)f32
prim::Constant           pnnx_23                  0 1 269 value=1
prim::Constant           pnnx_26                  0 1 279 value=None
prim::Constant           pnnx_27                  0 1 280 value=1
prim::Constant           pnnx_28                  0 1 281 value=0
prim::Constant           pnnx_29                  0 1 282 value=32
pnnx.Attribute           effnet._blocks.0._depthwise_conv 0 1 weight.5 @data=(32,1,3,3)f32 #weight.5=(32,1,3,3)f32
nn.ZeroPad2d             effnet._blocks.0._depthwise_conv.static_padding 1 1 176 285 padding=(1,1,1,1) #176=(1,32,64,250)f32 #285=(1,32,66,252)f32
prim::Constant           pnnx_30                  0 1 2381 value=1
prim::ListConstruct      pnnx_31                  2 1 280 2381 286
prim::Constant           pnnx_32                  0 1 2382 value=0
prim::ListConstruct      pnnx_33                  2 1 281 2382 287
prim::Constant           pnnx_34                  0 1 2383 value=1
prim::Constant           pnnx_35                  0 1 2384 value=1
prim::ListConstruct      pnnx_36                  2 1 2383 2384 288
F.conv2d                 F.conv2d_24              7 1 285 weight.5 279 286 287 288 282 input.5 $input=285 $weight=weight.5 $bias=279 $stride=286 $padding=287 $dilation=288 $groups=282 #285=(1,32,66,252)f32 #weight.5=(32,1,3,3)f32 #input.5=(1,32,64,250)f32
nn.BatchNorm2d           effnet._blocks.0._bn1    1 1 input.5 291 affine=True eps=1.000000e-03 num_features=32 @bias=(32)f32 @running_mean=(32)f32 @running_var=(32)f32 @weight=(32)f32 #input.5=(1,32,64,250)f32 #291=(1,32,64,250)f32
nn.SiLU                  effnet._blocks.0._swish  1 1 291 292 #291=(1,32,64,250)f32 #292=(1,32,64,250)f32
prim::Constant           pnnx_44                  0 1 2390 value=1
prim::ListConstruct      pnnx_45                  2 1 269 2390 293
prim::Constant           pnnx_49                  0 1 297 value=1
prim::Constant           pnnx_50                  0 1 298 value=0
pnnx.Attribute           effnet._blocks.0._se_reduce 0 1 bias.3 @data=(8)f32 #bias.3=(8)f32
pnnx.Attribute           effnet._blocks.0._se_reduce 0 1 weight.7 @data=(8,32,1,1)f32 #weight.7=(8,32,1,1)f32
prim::Constant           pnnx_51                  0 1 302 value=None
prim::Constant           pnnx_52                  0 1 2391 value=1
prim::ListConstruct      pnnx_53                  2 1 297 2391 303
prim::Constant           pnnx_54                  0 1 2392 value=0
prim::ListConstruct      pnnx_55                  2 1 298 2392 304
prim::Constant           pnnx_56                  0 1 2393 value=1
prim::Constant           pnnx_57                  0 1 2394 value=1
prim::ListConstruct      pnnx_58                  2 1 2393 2394 305
prim::Constant           pnnx_62                  0 1 2397 value=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_0  2 1 292 293 x.5 $input=292 $output_size=293 #292=(1,32,64,250)f32 #x.5=(1,32,1,1)f32
F.conv2d                 F.conv2d_25              7 1 x.5 weight.7 bias.3 303 304 305 2397 input.7 $input=x.5 $weight=weight.7 $bias=bias.3 $stride=303 $padding=304 $dilation=305 $groups=2397 #x.5=(1,32,1,1)f32 #weight.7=(8,32,1,1)f32 #bias.3=(8)f32 #input.7=(1,8,1,1)f32
nn.SiLU                  effnet._blocks.0._swish  1 1 input.7 308 #input.7=(1,8,1,1)f32 #308=(1,8,1,1)f32
prim::Constant           pnnx_69                  0 1 311 value=1
prim::Constant           pnnx_70                  0 1 312 value=0
pnnx.Attribute           effnet._blocks.0._se_expand 0 1 bias.5 @data=(32)f32 #bias.5=(32)f32
pnnx.Attribute           effnet._blocks.0._se_expand 0 1 weight.9 @data=(32,8,1,1)f32 #weight.9=(32,8,1,1)f32
prim::Constant           pnnx_71                  0 1 316 value=None
prim::Constant           pnnx_72                  0 1 2401 value=1
prim::ListConstruct      pnnx_73                  2 1 311 2401 317
prim::Constant           pnnx_74                  0 1 2402 value=0
prim::ListConstruct      pnnx_75                  2 1 312 2402 318
prim::Constant           pnnx_76                  0 1 2403 value=1
prim::Constant           pnnx_77                  0 1 2404 value=1
prim::ListConstruct      pnnx_78                  2 1 2403 2404 319
prim::Constant           pnnx_82                  0 1 2407 value=1
F.conv2d                 F.conv2d_26              7 1 308 weight.9 bias.5 317 318 319 2407 x_squeezed.2 $input=308 $weight=weight.9 $bias=bias.5 $stride=317 $padding=318 $dilation=319 $groups=2407 #308=(1,8,1,1)f32 #weight.9=(32,8,1,1)f32 #bias.5=(32)f32 #x_squeezed.2=(1,32,1,1)f32
F.sigmoid                F.sigmoid_138            1 1 x_squeezed.2 322 $input=x_squeezed.2 #x_squeezed.2=(1,32,1,1)f32 #322=(1,32,1,1)f32
aten::mul                pnnx_88                  2 1 322 292 x0.2 #322=(1,32,1,1)f32 #292=(1,32,64,250)f32 #x0.2=(1,32,64,250)f32
prim::Constant           pnnx_91                  0 1 326 value=None
prim::Constant           pnnx_92                  0 1 327 value=1
prim::Constant           pnnx_93                  0 1 328 value=0
pnnx.Attribute           effnet._blocks.0._project_conv 0 1 weight.11 @data=(16,32,1,1)f32 #weight.11=(16,32,1,1)f32
prim::Constant           pnnx_94                  0 1 331 value=None
prim::Constant           pnnx_95                  0 1 2411 value=1
prim::ListConstruct      pnnx_96                  2 1 327 2411 332
prim::Constant           pnnx_97                  0 1 2412 value=0
prim::ListConstruct      pnnx_98                  2 1 328 2412 333
prim::Constant           pnnx_99                  0 1 2413 value=1
prim::Constant           pnnx_100                 0 1 2414 value=1
prim::ListConstruct      pnnx_101                 2 1 2413 2414 334
prim::Constant           pnnx_105                 0 1 2417 value=1
F.conv2d                 F.conv2d_27              7 1 x0.2 weight.11 326 332 333 334 2417 input.9 $input=x0.2 $weight=weight.11 $bias=326 $stride=332 $padding=333 $dilation=334 $groups=2417 #x0.2=(1,32,64,250)f32 #weight.11=(16,32,1,1)f32 #input.9=(1,16,64,250)f32
nn.BatchNorm2d           effnet._blocks.0._bn2    1 1 input.9 337 affine=True eps=1.000000e-03 num_features=16 @bias=(16)f32 @running_mean=(16)f32 @running_var=(16)f32 @weight=(16)f32 #input.9=(1,16,64,250)f32 #337=(1,16,64,250)f32
prim::Constant           pnnx_110                 0 1 338 value=1
prim::Constant           pnnx_113                 0 1 348 value=None
prim::Constant           pnnx_114                 0 1 349 value=1
prim::Constant           pnnx_115                 0 1 350 value=0
prim::Constant           pnnx_116                 0 1 351 value=16
pnnx.Attribute           effnet._blocks.1._depthwise_conv 0 1 weight.13 @data=(16,1,3,3)f32 #weight.13=(16,1,3,3)f32
nn.ZeroPad2d             effnet._blocks.1._depthwise_conv.static_padding 1 1 337 354 padding=(1,1,1,1) #337=(1,16,64,250)f32 #354=(1,16,66,252)f32
prim::Constant           pnnx_117                 0 1 2421 value=1
prim::ListConstruct      pnnx_118                 2 1 349 2421 355
prim::Constant           pnnx_119                 0 1 2422 value=0
prim::ListConstruct      pnnx_120                 2 1 350 2422 356
prim::Constant           pnnx_121                 0 1 2423 value=1
prim::Constant           pnnx_122                 0 1 2424 value=1
prim::ListConstruct      pnnx_123                 2 1 2423 2424 357
F.conv2d                 F.conv2d_28              7 1 354 weight.13 348 355 356 357 351 input.11 $input=354 $weight=weight.13 $bias=348 $stride=355 $padding=356 $dilation=357 $groups=351 #354=(1,16,66,252)f32 #weight.13=(16,1,3,3)f32 #input.11=(1,16,64,250)f32
nn.BatchNorm2d           effnet._blocks.1._bn1    1 1 input.11 360 affine=True eps=1.000000e-03 num_features=16 @bias=(16)f32 @running_mean=(16)f32 @running_var=(16)f32 @weight=(16)f32 #input.11=(1,16,64,250)f32 #360=(1,16,64,250)f32
nn.SiLU                  effnet._blocks.1._swish  1 1 360 361 #360=(1,16,64,250)f32 #361=(1,16,64,250)f32
prim::Constant           pnnx_131                 0 1 2430 value=1
prim::ListConstruct      pnnx_132                 2 1 338 2430 362
prim::Constant           pnnx_136                 0 1 366 value=1
prim::Constant           pnnx_137                 0 1 367 value=0
pnnx.Attribute           effnet._blocks.1._se_reduce 0 1 bias.7 @data=(4)f32 #bias.7=(4)f32
pnnx.Attribute           effnet._blocks.1._se_reduce 0 1 weight.15 @data=(4,16,1,1)f32 #weight.15=(4,16,1,1)f32
prim::Constant           pnnx_138                 0 1 371 value=None
prim::Constant           pnnx_139                 0 1 2431 value=1
prim::ListConstruct      pnnx_140                 2 1 366 2431 372
prim::Constant           pnnx_141                 0 1 2432 value=0
prim::ListConstruct      pnnx_142                 2 1 367 2432 373
prim::Constant           pnnx_143                 0 1 2433 value=1
prim::Constant           pnnx_144                 0 1 2434 value=1
prim::ListConstruct      pnnx_145                 2 1 2433 2434 374
prim::Constant           pnnx_149                 0 1 2437 value=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_1  2 1 361 362 x.7 $input=361 $output_size=362 #361=(1,16,64,250)f32 #x.7=(1,16,1,1)f32
F.conv2d                 F.conv2d_29              7 1 x.7 weight.15 bias.7 372 373 374 2437 input.13 $input=x.7 $weight=weight.15 $bias=bias.7 $stride=372 $padding=373 $dilation=374 $groups=2437 #x.7=(1,16,1,1)f32 #weight.15=(4,16,1,1)f32 #bias.7=(4)f32 #input.13=(1,4,1,1)f32
nn.SiLU                  effnet._blocks.1._swish  1 1 input.13 377 #input.13=(1,4,1,1)f32 #377=(1,4,1,1)f32
prim::Constant           pnnx_156                 0 1 380 value=1
prim::Constant           pnnx_157                 0 1 381 value=0
pnnx.Attribute           effnet._blocks.1._se_expand 0 1 bias.9 @data=(16)f32 #bias.9=(16)f32
pnnx.Attribute           effnet._blocks.1._se_expand 0 1 weight.17 @data=(16,4,1,1)f32 #weight.17=(16,4,1,1)f32
prim::Constant           pnnx_158                 0 1 385 value=None
prim::Constant           pnnx_159                 0 1 2441 value=1
prim::ListConstruct      pnnx_160                 2 1 380 2441 386
prim::Constant           pnnx_161                 0 1 2442 value=0
prim::ListConstruct      pnnx_162                 2 1 381 2442 387
prim::Constant           pnnx_163                 0 1 2443 value=1
prim::Constant           pnnx_164                 0 1 2444 value=1
prim::ListConstruct      pnnx_165                 2 1 2443 2444 388
prim::Constant           pnnx_169                 0 1 2447 value=1
F.conv2d                 F.conv2d_30              7 1 377 weight.17 bias.9 386 387 388 2447 x_squeezed.4 $input=377 $weight=weight.17 $bias=bias.9 $stride=386 $padding=387 $dilation=388 $groups=2447 #377=(1,4,1,1)f32 #weight.17=(16,4,1,1)f32 #bias.9=(16)f32 #x_squeezed.4=(1,16,1,1)f32
F.sigmoid                F.sigmoid_139            1 1 x_squeezed.4 391 $input=x_squeezed.4 #x_squeezed.4=(1,16,1,1)f32 #391=(1,16,1,1)f32
aten::mul                pnnx_175                 2 1 391 361 x0.4 #391=(1,16,1,1)f32 #361=(1,16,64,250)f32 #x0.4=(1,16,64,250)f32
prim::Constant           pnnx_178                 0 1 395 value=None
prim::Constant           pnnx_179                 0 1 396 value=1
prim::Constant           pnnx_180                 0 1 397 value=0
pnnx.Attribute           effnet._blocks.1._project_conv 0 1 weight.19 @data=(16,16,1,1)f32 #weight.19=(16,16,1,1)f32
prim::Constant           pnnx_181                 0 1 400 value=None
prim::Constant           pnnx_182                 0 1 2451 value=1
prim::ListConstruct      pnnx_183                 2 1 396 2451 401
prim::Constant           pnnx_184                 0 1 2452 value=0
prim::ListConstruct      pnnx_185                 2 1 397 2452 402
prim::Constant           pnnx_186                 0 1 2453 value=1
prim::Constant           pnnx_187                 0 1 2454 value=1
prim::ListConstruct      pnnx_188                 2 1 2453 2454 403
prim::Constant           pnnx_192                 0 1 2457 value=1
F.conv2d                 F.conv2d_31              7 1 x0.4 weight.19 395 401 402 403 2457 input.15 $input=x0.4 $weight=weight.19 $bias=395 $stride=401 $padding=402 $dilation=403 $groups=2457 #x0.4=(1,16,64,250)f32 #weight.19=(16,16,1,1)f32 #input.15=(1,16,64,250)f32
nn.BatchNorm2d           effnet._blocks.1._bn2    1 1 input.15 406 affine=True eps=1.000000e-03 num_features=16 @bias=(16)f32 @running_mean=(16)f32 @running_var=(16)f32 @weight=(16)f32 #input.15=(1,16,64,250)f32 #406=(1,16,64,250)f32
prim::Constant           pnnx_197                 0 1 2461 value=1
aten::add                pnnx_198                 3 1 406 337 2461 407 #406=(1,16,64,250)f32 #337=(1,16,64,250)f32 #407=(1,16,64,250)f32
prim::Constant           pnnx_199                 0 1 408 value=1
prim::Constant           pnnx_202                 0 1 420 value=None
prim::Constant           pnnx_203                 0 1 421 value=1
prim::Constant           pnnx_204                 0 1 422 value=0
pnnx.Attribute           effnet._blocks.2._expand_conv 0 1 weight.21 @data=(96,16,1,1)f32 #weight.21=(96,16,1,1)f32
prim::Constant           pnnx_205                 0 1 425 value=None
prim::Constant           pnnx_206                 0 1 2462 value=1
prim::ListConstruct      pnnx_207                 2 1 421 2462 426
prim::Constant           pnnx_208                 0 1 2463 value=0
prim::ListConstruct      pnnx_209                 2 1 422 2463 427
prim::Constant           pnnx_210                 0 1 2464 value=1
prim::Constant           pnnx_211                 0 1 2465 value=1
prim::ListConstruct      pnnx_212                 2 1 2464 2465 428
prim::Constant           pnnx_216                 0 1 2468 value=1
F.conv2d                 F.conv2d_32              7 1 407 weight.21 420 426 427 428 2468 input.17 $input=407 $weight=weight.21 $bias=420 $stride=426 $padding=427 $dilation=428 $groups=2468 #407=(1,16,64,250)f32 #weight.21=(96,16,1,1)f32 #input.17=(1,96,64,250)f32
nn.BatchNorm2d           effnet._blocks.2._bn0    1 1 input.17 431 affine=True eps=1.000000e-03 num_features=96 @bias=(96)f32 @running_mean=(96)f32 @running_var=(96)f32 @weight=(96)f32 #input.17=(1,96,64,250)f32 #431=(1,96,64,250)f32
nn.SiLU                  effnet._blocks.2._swish  1 1 431 432 #431=(1,96,64,250)f32 #432=(1,96,64,250)f32
prim::Constant           pnnx_223                 0 1 435 value=None
prim::Constant           pnnx_224                 0 1 436 value=2
prim::Constant           pnnx_225                 0 1 437 value=0
prim::Constant           pnnx_226                 0 1 438 value=1
prim::Constant           pnnx_227                 0 1 439 value=96
pnnx.Attribute           effnet._blocks.2._depthwise_conv 0 1 weight.23 @data=(96,1,3,3)f32 #weight.23=(96,1,3,3)f32
nn.ZeroPad2d             effnet._blocks.2._depthwise_conv.static_padding 1 1 432 442 padding=(0,1,0,1) #432=(1,96,64,250)f32 #442=(1,96,65,251)f32
prim::Constant           pnnx_228                 0 1 2472 value=2
prim::ListConstruct      pnnx_229                 2 1 436 2472 443
prim::Constant           pnnx_230                 0 1 2473 value=0
prim::ListConstruct      pnnx_231                 2 1 437 2473 444
prim::Constant           pnnx_232                 0 1 2474 value=1
prim::ListConstruct      pnnx_233                 2 1 438 2474 445
F.conv2d                 F.conv2d_33              7 1 442 weight.23 435 443 444 445 439 input.19 $input=442 $weight=weight.23 $bias=435 $stride=443 $padding=444 $dilation=445 $groups=439 #442=(1,96,65,251)f32 #weight.23=(96,1,3,3)f32 #input.19=(1,96,32,125)f32
nn.BatchNorm2d           effnet._blocks.2._bn1    1 1 input.19 448 affine=True eps=1.000000e-03 num_features=96 @bias=(96)f32 @running_mean=(96)f32 @running_var=(96)f32 @weight=(96)f32 #input.19=(1,96,32,125)f32 #448=(1,96,32,125)f32
nn.SiLU                  effnet._blocks.2._swish  1 1 448 449 #448=(1,96,32,125)f32 #449=(1,96,32,125)f32
prim::Constant           pnnx_241                 0 1 2480 value=1
prim::ListConstruct      pnnx_242                 2 1 408 2480 450
prim::Constant           pnnx_246                 0 1 454 value=1
prim::Constant           pnnx_247                 0 1 455 value=0
pnnx.Attribute           effnet._blocks.2._se_reduce 0 1 bias.11 @data=(4)f32 #bias.11=(4)f32
pnnx.Attribute           effnet._blocks.2._se_reduce 0 1 weight.25 @data=(4,96,1,1)f32 #weight.25=(4,96,1,1)f32
prim::Constant           pnnx_248                 0 1 459 value=None
prim::Constant           pnnx_249                 0 1 2481 value=1
prim::ListConstruct      pnnx_250                 2 1 454 2481 460
prim::Constant           pnnx_251                 0 1 2482 value=0
prim::ListConstruct      pnnx_252                 2 1 455 2482 461
prim::Constant           pnnx_253                 0 1 2483 value=1
prim::Constant           pnnx_254                 0 1 2484 value=1
prim::ListConstruct      pnnx_255                 2 1 2483 2484 462
prim::Constant           pnnx_259                 0 1 2487 value=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_2  2 1 449 450 x.9 $input=449 $output_size=450 #449=(1,96,32,125)f32 #x.9=(1,96,1,1)f32
F.conv2d                 F.conv2d_34              7 1 x.9 weight.25 bias.11 460 461 462 2487 input.21 $input=x.9 $weight=weight.25 $bias=bias.11 $stride=460 $padding=461 $dilation=462 $groups=2487 #x.9=(1,96,1,1)f32 #weight.25=(4,96,1,1)f32 #bias.11=(4)f32 #input.21=(1,4,1,1)f32
nn.SiLU                  effnet._blocks.2._swish  1 1 input.21 465 #input.21=(1,4,1,1)f32 #465=(1,4,1,1)f32
prim::Constant           pnnx_266                 0 1 468 value=1
prim::Constant           pnnx_267                 0 1 469 value=0
pnnx.Attribute           effnet._blocks.2._se_expand 0 1 bias.13 @data=(96)f32 #bias.13=(96)f32
pnnx.Attribute           effnet._blocks.2._se_expand 0 1 weight.27 @data=(96,4,1,1)f32 #weight.27=(96,4,1,1)f32
prim::Constant           pnnx_268                 0 1 473 value=None
prim::Constant           pnnx_269                 0 1 2491 value=1
prim::ListConstruct      pnnx_270                 2 1 468 2491 474
prim::Constant           pnnx_271                 0 1 2492 value=0
prim::ListConstruct      pnnx_272                 2 1 469 2492 475
prim::Constant           pnnx_273                 0 1 2493 value=1
prim::Constant           pnnx_274                 0 1 2494 value=1
prim::ListConstruct      pnnx_275                 2 1 2493 2494 476
prim::Constant           pnnx_279                 0 1 2497 value=1
F.conv2d                 F.conv2d_35              7 1 465 weight.27 bias.13 474 475 476 2497 x_squeezed.6 $input=465 $weight=weight.27 $bias=bias.13 $stride=474 $padding=475 $dilation=476 $groups=2497 #465=(1,4,1,1)f32 #weight.27=(96,4,1,1)f32 #bias.13=(96)f32 #x_squeezed.6=(1,96,1,1)f32
F.sigmoid                F.sigmoid_140            1 1 x_squeezed.6 479 $input=x_squeezed.6 #x_squeezed.6=(1,96,1,1)f32 #479=(1,96,1,1)f32
aten::mul                pnnx_285                 2 1 479 449 x0.6 #479=(1,96,1,1)f32 #449=(1,96,32,125)f32 #x0.6=(1,96,32,125)f32
prim::Constant           pnnx_288                 0 1 483 value=None
prim::Constant           pnnx_289                 0 1 484 value=1
prim::Constant           pnnx_290                 0 1 485 value=0
pnnx.Attribute           effnet._blocks.2._project_conv 0 1 weight.29 @data=(24,96,1,1)f32 #weight.29=(24,96,1,1)f32
prim::Constant           pnnx_291                 0 1 488 value=None
prim::Constant           pnnx_292                 0 1 2501 value=1
prim::ListConstruct      pnnx_293                 2 1 484 2501 489
prim::Constant           pnnx_294                 0 1 2502 value=0
prim::ListConstruct      pnnx_295                 2 1 485 2502 490
prim::Constant           pnnx_296                 0 1 2503 value=1
prim::Constant           pnnx_297                 0 1 2504 value=1
prim::ListConstruct      pnnx_298                 2 1 2503 2504 491
prim::Constant           pnnx_302                 0 1 2507 value=1
F.conv2d                 F.conv2d_36              7 1 x0.6 weight.29 483 489 490 491 2507 input.23 $input=x0.6 $weight=weight.29 $bias=483 $stride=489 $padding=490 $dilation=491 $groups=2507 #x0.6=(1,96,32,125)f32 #weight.29=(24,96,1,1)f32 #input.23=(1,24,32,125)f32
nn.BatchNorm2d           effnet._blocks.2._bn2    1 1 input.23 494 affine=True eps=1.000000e-03 num_features=24 @bias=(24)f32 @running_mean=(24)f32 @running_var=(24)f32 @weight=(24)f32 #input.23=(1,24,32,125)f32 #494=(1,24,32,125)f32
prim::Constant           pnnx_307                 0 1 495 value=1
prim::Constant           pnnx_310                 0 1 507 value=None
prim::Constant           pnnx_311                 0 1 508 value=1
prim::Constant           pnnx_312                 0 1 509 value=0
pnnx.Attribute           effnet._blocks.3._expand_conv 0 1 weight.31 @data=(144,24,1,1)f32 #weight.31=(144,24,1,1)f32
prim::Constant           pnnx_313                 0 1 512 value=None
prim::Constant           pnnx_314                 0 1 2511 value=1
prim::ListConstruct      pnnx_315                 2 1 508 2511 513
prim::Constant           pnnx_316                 0 1 2512 value=0
prim::ListConstruct      pnnx_317                 2 1 509 2512 514
prim::Constant           pnnx_318                 0 1 2513 value=1
prim::Constant           pnnx_319                 0 1 2514 value=1
prim::ListConstruct      pnnx_320                 2 1 2513 2514 515
prim::Constant           pnnx_324                 0 1 2517 value=1
F.conv2d                 F.conv2d_37              7 1 494 weight.31 507 513 514 515 2517 input.25 $input=494 $weight=weight.31 $bias=507 $stride=513 $padding=514 $dilation=515 $groups=2517 #494=(1,24,32,125)f32 #weight.31=(144,24,1,1)f32 #input.25=(1,144,32,125)f32
nn.BatchNorm2d           effnet._blocks.3._bn0    1 1 input.25 518 affine=True eps=1.000000e-03 num_features=144 @bias=(144)f32 @running_mean=(144)f32 @running_var=(144)f32 @weight=(144)f32 #input.25=(1,144,32,125)f32 #518=(1,144,32,125)f32
nn.SiLU                  effnet._blocks.3._swish  1 1 518 519 #518=(1,144,32,125)f32 #519=(1,144,32,125)f32
prim::Constant           pnnx_331                 0 1 522 value=None
prim::Constant           pnnx_332                 0 1 523 value=1
prim::Constant           pnnx_333                 0 1 524 value=0
prim::Constant           pnnx_334                 0 1 525 value=144
pnnx.Attribute           effnet._blocks.3._depthwise_conv 0 1 weight.33 @data=(144,1,3,3)f32 #weight.33=(144,1,3,3)f32
nn.ZeroPad2d             effnet._blocks.3._depthwise_conv.static_padding 1 1 519 528 padding=(1,1,1,1) #519=(1,144,32,125)f32 #528=(1,144,34,127)f32
prim::Constant           pnnx_335                 0 1 2521 value=1
prim::ListConstruct      pnnx_336                 2 1 523 2521 529
prim::Constant           pnnx_337                 0 1 2522 value=0
prim::ListConstruct      pnnx_338                 2 1 524 2522 530
prim::Constant           pnnx_339                 0 1 2523 value=1
prim::Constant           pnnx_340                 0 1 2524 value=1
prim::ListConstruct      pnnx_341                 2 1 2523 2524 531
F.conv2d                 F.conv2d_38              7 1 528 weight.33 522 529 530 531 525 input.27 $input=528 $weight=weight.33 $bias=522 $stride=529 $padding=530 $dilation=531 $groups=525 #528=(1,144,34,127)f32 #weight.33=(144,1,3,3)f32 #input.27=(1,144,32,125)f32
nn.BatchNorm2d           effnet._blocks.3._bn1    1 1 input.27 534 affine=True eps=1.000000e-03 num_features=144 @bias=(144)f32 @running_mean=(144)f32 @running_var=(144)f32 @weight=(144)f32 #input.27=(1,144,32,125)f32 #534=(1,144,32,125)f32
nn.SiLU                  effnet._blocks.3._swish  1 1 534 535 #534=(1,144,32,125)f32 #535=(1,144,32,125)f32
prim::Constant           pnnx_349                 0 1 2530 value=1
prim::ListConstruct      pnnx_350                 2 1 495 2530 536
prim::Constant           pnnx_354                 0 1 540 value=1
prim::Constant           pnnx_355                 0 1 541 value=0
pnnx.Attribute           effnet._blocks.3._se_reduce 0 1 bias.15 @data=(6)f32 #bias.15=(6)f32
pnnx.Attribute           effnet._blocks.3._se_reduce 0 1 weight.35 @data=(6,144,1,1)f32 #weight.35=(6,144,1,1)f32
prim::Constant           pnnx_356                 0 1 545 value=None
prim::Constant           pnnx_357                 0 1 2531 value=1
prim::ListConstruct      pnnx_358                 2 1 540 2531 546
prim::Constant           pnnx_359                 0 1 2532 value=0
prim::ListConstruct      pnnx_360                 2 1 541 2532 547
prim::Constant           pnnx_361                 0 1 2533 value=1
prim::Constant           pnnx_362                 0 1 2534 value=1
prim::ListConstruct      pnnx_363                 2 1 2533 2534 548
prim::Constant           pnnx_367                 0 1 2537 value=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_3  2 1 535 536 x.11 $input=535 $output_size=536 #535=(1,144,32,125)f32 #x.11=(1,144,1,1)f32
F.conv2d                 F.conv2d_39              7 1 x.11 weight.35 bias.15 546 547 548 2537 input.29 $input=x.11 $weight=weight.35 $bias=bias.15 $stride=546 $padding=547 $dilation=548 $groups=2537 #x.11=(1,144,1,1)f32 #weight.35=(6,144,1,1)f32 #bias.15=(6)f32 #input.29=(1,6,1,1)f32
nn.SiLU                  effnet._blocks.3._swish  1 1 input.29 551 #input.29=(1,6,1,1)f32 #551=(1,6,1,1)f32
prim::Constant           pnnx_374                 0 1 554 value=1
prim::Constant           pnnx_375                 0 1 555 value=0
pnnx.Attribute           effnet._blocks.3._se_expand 0 1 bias.17 @data=(144)f32 #bias.17=(144)f32
pnnx.Attribute           effnet._blocks.3._se_expand 0 1 weight.37 @data=(144,6,1,1)f32 #weight.37=(144,6,1,1)f32
prim::Constant           pnnx_376                 0 1 559 value=None
prim::Constant           pnnx_377                 0 1 2541 value=1
prim::ListConstruct      pnnx_378                 2 1 554 2541 560
prim::Constant           pnnx_379                 0 1 2542 value=0
prim::ListConstruct      pnnx_380                 2 1 555 2542 561
prim::Constant           pnnx_381                 0 1 2543 value=1
prim::Constant           pnnx_382                 0 1 2544 value=1
prim::ListConstruct      pnnx_383                 2 1 2543 2544 562
prim::Constant           pnnx_387                 0 1 2547 value=1
F.conv2d                 F.conv2d_40              7 1 551 weight.37 bias.17 560 561 562 2547 x_squeezed.8 $input=551 $weight=weight.37 $bias=bias.17 $stride=560 $padding=561 $dilation=562 $groups=2547 #551=(1,6,1,1)f32 #weight.37=(144,6,1,1)f32 #bias.17=(144)f32 #x_squeezed.8=(1,144,1,1)f32
F.sigmoid                F.sigmoid_141            1 1 x_squeezed.8 565 $input=x_squeezed.8 #x_squeezed.8=(1,144,1,1)f32 #565=(1,144,1,1)f32
aten::mul                pnnx_393                 2 1 565 535 x0.8 #565=(1,144,1,1)f32 #535=(1,144,32,125)f32 #x0.8=(1,144,32,125)f32
prim::Constant           pnnx_396                 0 1 569 value=None
prim::Constant           pnnx_397                 0 1 570 value=1
prim::Constant           pnnx_398                 0 1 571 value=0
pnnx.Attribute           effnet._blocks.3._project_conv 0 1 weight.39 @data=(24,144,1,1)f32 #weight.39=(24,144,1,1)f32
prim::Constant           pnnx_399                 0 1 574 value=None
prim::Constant           pnnx_400                 0 1 2551 value=1
prim::ListConstruct      pnnx_401                 2 1 570 2551 575
prim::Constant           pnnx_402                 0 1 2552 value=0
prim::ListConstruct      pnnx_403                 2 1 571 2552 576
prim::Constant           pnnx_404                 0 1 2553 value=1
prim::Constant           pnnx_405                 0 1 2554 value=1
prim::ListConstruct      pnnx_406                 2 1 2553 2554 577
prim::Constant           pnnx_410                 0 1 2557 value=1
F.conv2d                 F.conv2d_41              7 1 x0.8 weight.39 569 575 576 577 2557 input.31 $input=x0.8 $weight=weight.39 $bias=569 $stride=575 $padding=576 $dilation=577 $groups=2557 #x0.8=(1,144,32,125)f32 #weight.39=(24,144,1,1)f32 #input.31=(1,24,32,125)f32
nn.BatchNorm2d           effnet._blocks.3._bn2    1 1 input.31 580 affine=True eps=1.000000e-03 num_features=24 @bias=(24)f32 @running_mean=(24)f32 @running_var=(24)f32 @weight=(24)f32 #input.31=(1,24,32,125)f32 #580=(1,24,32,125)f32
prim::Constant           pnnx_415                 0 1 2561 value=1
aten::add                pnnx_416                 3 1 580 494 2561 581 #580=(1,24,32,125)f32 #494=(1,24,32,125)f32 #581=(1,24,32,125)f32
prim::Constant           pnnx_417                 0 1 582 value=1
prim::Constant           pnnx_420                 0 1 594 value=None
prim::Constant           pnnx_421                 0 1 595 value=1
prim::Constant           pnnx_422                 0 1 596 value=0
pnnx.Attribute           effnet._blocks.4._expand_conv 0 1 weight.41 @data=(144,24,1,1)f32 #weight.41=(144,24,1,1)f32
prim::Constant           pnnx_423                 0 1 599 value=None
prim::Constant           pnnx_424                 0 1 2562 value=1
prim::ListConstruct      pnnx_425                 2 1 595 2562 600
prim::Constant           pnnx_426                 0 1 2563 value=0
prim::ListConstruct      pnnx_427                 2 1 596 2563 601
prim::Constant           pnnx_428                 0 1 2564 value=1
prim::Constant           pnnx_429                 0 1 2565 value=1
prim::ListConstruct      pnnx_430                 2 1 2564 2565 602
prim::Constant           pnnx_434                 0 1 2568 value=1
F.conv2d                 F.conv2d_42              7 1 581 weight.41 594 600 601 602 2568 input.33 $input=581 $weight=weight.41 $bias=594 $stride=600 $padding=601 $dilation=602 $groups=2568 #581=(1,24,32,125)f32 #weight.41=(144,24,1,1)f32 #input.33=(1,144,32,125)f32
nn.BatchNorm2d           effnet._blocks.4._bn0    1 1 input.33 605 affine=True eps=1.000000e-03 num_features=144 @bias=(144)f32 @running_mean=(144)f32 @running_var=(144)f32 @weight=(144)f32 #input.33=(1,144,32,125)f32 #605=(1,144,32,125)f32
nn.SiLU                  effnet._blocks.4._swish  1 1 605 606 #605=(1,144,32,125)f32 #606=(1,144,32,125)f32
prim::Constant           pnnx_441                 0 1 609 value=None
prim::Constant           pnnx_442                 0 1 610 value=1
prim::Constant           pnnx_443                 0 1 611 value=0
prim::Constant           pnnx_444                 0 1 612 value=144
pnnx.Attribute           effnet._blocks.4._depthwise_conv 0 1 weight.43 @data=(144,1,3,3)f32 #weight.43=(144,1,3,3)f32
nn.ZeroPad2d             effnet._blocks.4._depthwise_conv.static_padding 1 1 606 615 padding=(1,1,1,1) #606=(1,144,32,125)f32 #615=(1,144,34,127)f32
prim::Constant           pnnx_445                 0 1 2572 value=1
prim::ListConstruct      pnnx_446                 2 1 610 2572 616
prim::Constant           pnnx_447                 0 1 2573 value=0
prim::ListConstruct      pnnx_448                 2 1 611 2573 617
prim::Constant           pnnx_449                 0 1 2574 value=1
prim::Constant           pnnx_450                 0 1 2575 value=1
prim::ListConstruct      pnnx_451                 2 1 2574 2575 618
F.conv2d                 F.conv2d_43              7 1 615 weight.43 609 616 617 618 612 input.35 $input=615 $weight=weight.43 $bias=609 $stride=616 $padding=617 $dilation=618 $groups=612 #615=(1,144,34,127)f32 #weight.43=(144,1,3,3)f32 #input.35=(1,144,32,125)f32
nn.BatchNorm2d           effnet._blocks.4._bn1    1 1 input.35 621 affine=True eps=1.000000e-03 num_features=144 @bias=(144)f32 @running_mean=(144)f32 @running_var=(144)f32 @weight=(144)f32 #input.35=(1,144,32,125)f32 #621=(1,144,32,125)f32
nn.SiLU                  effnet._blocks.4._swish  1 1 621 622 #621=(1,144,32,125)f32 #622=(1,144,32,125)f32
prim::Constant           pnnx_459                 0 1 2581 value=1
prim::ListConstruct      pnnx_460                 2 1 582 2581 623
prim::Constant           pnnx_464                 0 1 627 value=1
prim::Constant           pnnx_465                 0 1 628 value=0
pnnx.Attribute           effnet._blocks.4._se_reduce 0 1 bias.19 @data=(6)f32 #bias.19=(6)f32
pnnx.Attribute           effnet._blocks.4._se_reduce 0 1 weight.45 @data=(6,144,1,1)f32 #weight.45=(6,144,1,1)f32
prim::Constant           pnnx_466                 0 1 632 value=None
prim::Constant           pnnx_467                 0 1 2582 value=1
prim::ListConstruct      pnnx_468                 2 1 627 2582 633
prim::Constant           pnnx_469                 0 1 2583 value=0
prim::ListConstruct      pnnx_470                 2 1 628 2583 634
prim::Constant           pnnx_471                 0 1 2584 value=1
prim::Constant           pnnx_472                 0 1 2585 value=1
prim::ListConstruct      pnnx_473                 2 1 2584 2585 635
prim::Constant           pnnx_477                 0 1 2588 value=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_4  2 1 622 623 x.13 $input=622 $output_size=623 #622=(1,144,32,125)f32 #x.13=(1,144,1,1)f32
F.conv2d                 F.conv2d_44              7 1 x.13 weight.45 bias.19 633 634 635 2588 input.37 $input=x.13 $weight=weight.45 $bias=bias.19 $stride=633 $padding=634 $dilation=635 $groups=2588 #x.13=(1,144,1,1)f32 #weight.45=(6,144,1,1)f32 #bias.19=(6)f32 #input.37=(1,6,1,1)f32
nn.SiLU                  effnet._blocks.4._swish  1 1 input.37 638 #input.37=(1,6,1,1)f32 #638=(1,6,1,1)f32
prim::Constant           pnnx_484                 0 1 641 value=1
prim::Constant           pnnx_485                 0 1 642 value=0
pnnx.Attribute           effnet._blocks.4._se_expand 0 1 bias.21 @data=(144)f32 #bias.21=(144)f32
pnnx.Attribute           effnet._blocks.4._se_expand 0 1 weight.47 @data=(144,6,1,1)f32 #weight.47=(144,6,1,1)f32
prim::Constant           pnnx_486                 0 1 646 value=None
prim::Constant           pnnx_487                 0 1 2592 value=1
prim::ListConstruct      pnnx_488                 2 1 641 2592 647
prim::Constant           pnnx_489                 0 1 2593 value=0
prim::ListConstruct      pnnx_490                 2 1 642 2593 648
prim::Constant           pnnx_491                 0 1 2594 value=1
prim::Constant           pnnx_492                 0 1 2595 value=1
prim::ListConstruct      pnnx_493                 2 1 2594 2595 649
prim::Constant           pnnx_497                 0 1 2598 value=1
F.conv2d                 F.conv2d_45              7 1 638 weight.47 bias.21 647 648 649 2598 x_squeezed.10 $input=638 $weight=weight.47 $bias=bias.21 $stride=647 $padding=648 $dilation=649 $groups=2598 #638=(1,6,1,1)f32 #weight.47=(144,6,1,1)f32 #bias.21=(144)f32 #x_squeezed.10=(1,144,1,1)f32
F.sigmoid                F.sigmoid_142            1 1 x_squeezed.10 652 $input=x_squeezed.10 #x_squeezed.10=(1,144,1,1)f32 #652=(1,144,1,1)f32
aten::mul                pnnx_503                 2 1 652 622 x0.10 #652=(1,144,1,1)f32 #622=(1,144,32,125)f32 #x0.10=(1,144,32,125)f32
prim::Constant           pnnx_506                 0 1 656 value=None
prim::Constant           pnnx_507                 0 1 657 value=1
prim::Constant           pnnx_508                 0 1 658 value=0
pnnx.Attribute           effnet._blocks.4._project_conv 0 1 weight.49 @data=(24,144,1,1)f32 #weight.49=(24,144,1,1)f32
prim::Constant           pnnx_509                 0 1 661 value=None
prim::Constant           pnnx_510                 0 1 2602 value=1
prim::ListConstruct      pnnx_511                 2 1 657 2602 662
prim::Constant           pnnx_512                 0 1 2603 value=0
prim::ListConstruct      pnnx_513                 2 1 658 2603 663
prim::Constant           pnnx_514                 0 1 2604 value=1
prim::Constant           pnnx_515                 0 1 2605 value=1
prim::ListConstruct      pnnx_516                 2 1 2604 2605 664
prim::Constant           pnnx_520                 0 1 2608 value=1
F.conv2d                 F.conv2d_46              7 1 x0.10 weight.49 656 662 663 664 2608 input.39 $input=x0.10 $weight=weight.49 $bias=656 $stride=662 $padding=663 $dilation=664 $groups=2608 #x0.10=(1,144,32,125)f32 #weight.49=(24,144,1,1)f32 #input.39=(1,24,32,125)f32
nn.BatchNorm2d           effnet._blocks.4._bn2    1 1 input.39 667 affine=True eps=1.000000e-03 num_features=24 @bias=(24)f32 @running_mean=(24)f32 @running_var=(24)f32 @weight=(24)f32 #input.39=(1,24,32,125)f32 #667=(1,24,32,125)f32
prim::Constant           pnnx_525                 0 1 2612 value=1
aten::add                pnnx_526                 3 1 667 581 2612 668 #667=(1,24,32,125)f32 #581=(1,24,32,125)f32 #668=(1,24,32,125)f32
prim::Constant           pnnx_527                 0 1 669 value=1
prim::Constant           pnnx_530                 0 1 681 value=None
prim::Constant           pnnx_531                 0 1 682 value=1
prim::Constant           pnnx_532                 0 1 683 value=0
pnnx.Attribute           effnet._blocks.5._expand_conv 0 1 weight.51 @data=(144,24,1,1)f32 #weight.51=(144,24,1,1)f32
prim::Constant           pnnx_533                 0 1 686 value=None
prim::Constant           pnnx_534                 0 1 2613 value=1
prim::ListConstruct      pnnx_535                 2 1 682 2613 687
prim::Constant           pnnx_536                 0 1 2614 value=0
prim::ListConstruct      pnnx_537                 2 1 683 2614 688
prim::Constant           pnnx_538                 0 1 2615 value=1
prim::Constant           pnnx_539                 0 1 2616 value=1
prim::ListConstruct      pnnx_540                 2 1 2615 2616 689
prim::Constant           pnnx_544                 0 1 2619 value=1
F.conv2d                 F.conv2d_47              7 1 668 weight.51 681 687 688 689 2619 input.41 $input=668 $weight=weight.51 $bias=681 $stride=687 $padding=688 $dilation=689 $groups=2619 #668=(1,24,32,125)f32 #weight.51=(144,24,1,1)f32 #input.41=(1,144,32,125)f32
nn.BatchNorm2d           effnet._blocks.5._bn0    1 1 input.41 692 affine=True eps=1.000000e-03 num_features=144 @bias=(144)f32 @running_mean=(144)f32 @running_var=(144)f32 @weight=(144)f32 #input.41=(1,144,32,125)f32 #692=(1,144,32,125)f32
nn.SiLU                  effnet._blocks.5._swish  1 1 692 693 #692=(1,144,32,125)f32 #693=(1,144,32,125)f32
prim::Constant           pnnx_551                 0 1 696 value=None
prim::Constant           pnnx_552                 0 1 697 value=2
prim::Constant           pnnx_553                 0 1 698 value=0
prim::Constant           pnnx_554                 0 1 699 value=1
prim::Constant           pnnx_555                 0 1 700 value=144
pnnx.Attribute           effnet._blocks.5._depthwise_conv 0 1 weight.53 @data=(144,1,5,5)f32 #weight.53=(144,1,5,5)f32
nn.ZeroPad2d             effnet._blocks.5._depthwise_conv.static_padding 1 1 693 703 padding=(2,2,2,2) #693=(1,144,32,125)f32 #703=(1,144,36,129)f32
prim::Constant           pnnx_556                 0 1 2623 value=2
prim::ListConstruct      pnnx_557                 2 1 697 2623 704
prim::Constant           pnnx_558                 0 1 2624 value=0
prim::ListConstruct      pnnx_559                 2 1 698 2624 705
prim::Constant           pnnx_560                 0 1 2625 value=1
prim::ListConstruct      pnnx_561                 2 1 699 2625 706
F.conv2d                 F.conv2d_48              7 1 703 weight.53 696 704 705 706 700 input.43 $input=703 $weight=weight.53 $bias=696 $stride=704 $padding=705 $dilation=706 $groups=700 #703=(1,144,36,129)f32 #weight.53=(144,1,5,5)f32 #input.43=(1,144,16,63)f32
nn.BatchNorm2d           effnet._blocks.5._bn1    1 1 input.43 709 affine=True eps=1.000000e-03 num_features=144 @bias=(144)f32 @running_mean=(144)f32 @running_var=(144)f32 @weight=(144)f32 #input.43=(1,144,16,63)f32 #709=(1,144,16,63)f32
nn.SiLU                  effnet._blocks.5._swish  1 1 709 710 #709=(1,144,16,63)f32 #710=(1,144,16,63)f32
prim::Constant           pnnx_569                 0 1 2631 value=1
prim::ListConstruct      pnnx_570                 2 1 669 2631 711
prim::Constant           pnnx_574                 0 1 715 value=1
prim::Constant           pnnx_575                 0 1 716 value=0
pnnx.Attribute           effnet._blocks.5._se_reduce 0 1 bias.23 @data=(6)f32 #bias.23=(6)f32
pnnx.Attribute           effnet._blocks.5._se_reduce 0 1 weight.55 @data=(6,144,1,1)f32 #weight.55=(6,144,1,1)f32
prim::Constant           pnnx_576                 0 1 720 value=None
prim::Constant           pnnx_577                 0 1 2632 value=1
prim::ListConstruct      pnnx_578                 2 1 715 2632 721
prim::Constant           pnnx_579                 0 1 2633 value=0
prim::ListConstruct      pnnx_580                 2 1 716 2633 722
prim::Constant           pnnx_581                 0 1 2634 value=1
prim::Constant           pnnx_582                 0 1 2635 value=1
prim::ListConstruct      pnnx_583                 2 1 2634 2635 723
prim::Constant           pnnx_587                 0 1 2638 value=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_5  2 1 710 711 x.15 $input=710 $output_size=711 #710=(1,144,16,63)f32 #x.15=(1,144,1,1)f32
F.conv2d                 F.conv2d_49              7 1 x.15 weight.55 bias.23 721 722 723 2638 input.45 $input=x.15 $weight=weight.55 $bias=bias.23 $stride=721 $padding=722 $dilation=723 $groups=2638 #x.15=(1,144,1,1)f32 #weight.55=(6,144,1,1)f32 #bias.23=(6)f32 #input.45=(1,6,1,1)f32
nn.SiLU                  effnet._blocks.5._swish  1 1 input.45 726 #input.45=(1,6,1,1)f32 #726=(1,6,1,1)f32
prim::Constant           pnnx_594                 0 1 729 value=1
prim::Constant           pnnx_595                 0 1 730 value=0
pnnx.Attribute           effnet._blocks.5._se_expand 0 1 bias.25 @data=(144)f32 #bias.25=(144)f32
pnnx.Attribute           effnet._blocks.5._se_expand 0 1 weight.57 @data=(144,6,1,1)f32 #weight.57=(144,6,1,1)f32
prim::Constant           pnnx_596                 0 1 734 value=None
prim::Constant           pnnx_597                 0 1 2642 value=1
prim::ListConstruct      pnnx_598                 2 1 729 2642 735
prim::Constant           pnnx_599                 0 1 2643 value=0
prim::ListConstruct      pnnx_600                 2 1 730 2643 736
prim::Constant           pnnx_601                 0 1 2644 value=1
prim::Constant           pnnx_602                 0 1 2645 value=1
prim::ListConstruct      pnnx_603                 2 1 2644 2645 737
prim::Constant           pnnx_607                 0 1 2648 value=1
F.conv2d                 F.conv2d_50              7 1 726 weight.57 bias.25 735 736 737 2648 x_squeezed.12 $input=726 $weight=weight.57 $bias=bias.25 $stride=735 $padding=736 $dilation=737 $groups=2648 #726=(1,6,1,1)f32 #weight.57=(144,6,1,1)f32 #bias.25=(144)f32 #x_squeezed.12=(1,144,1,1)f32
F.sigmoid                F.sigmoid_143            1 1 x_squeezed.12 740 $input=x_squeezed.12 #x_squeezed.12=(1,144,1,1)f32 #740=(1,144,1,1)f32
aten::mul                pnnx_613                 2 1 740 710 x0.12 #740=(1,144,1,1)f32 #710=(1,144,16,63)f32 #x0.12=(1,144,16,63)f32
prim::Constant           pnnx_616                 0 1 744 value=None
prim::Constant           pnnx_617                 0 1 745 value=1
prim::Constant           pnnx_618                 0 1 746 value=0
pnnx.Attribute           effnet._blocks.5._project_conv 0 1 weight.59 @data=(48,144,1,1)f32 #weight.59=(48,144,1,1)f32
prim::Constant           pnnx_619                 0 1 749 value=None
prim::Constant           pnnx_620                 0 1 2652 value=1
prim::ListConstruct      pnnx_621                 2 1 745 2652 750
prim::Constant           pnnx_622                 0 1 2653 value=0
prim::ListConstruct      pnnx_623                 2 1 746 2653 751
prim::Constant           pnnx_624                 0 1 2654 value=1
prim::Constant           pnnx_625                 0 1 2655 value=1
prim::ListConstruct      pnnx_626                 2 1 2654 2655 752
prim::Constant           pnnx_630                 0 1 2658 value=1
F.conv2d                 F.conv2d_51              7 1 x0.12 weight.59 744 750 751 752 2658 input.47 $input=x0.12 $weight=weight.59 $bias=744 $stride=750 $padding=751 $dilation=752 $groups=2658 #x0.12=(1,144,16,63)f32 #weight.59=(48,144,1,1)f32 #input.47=(1,48,16,63)f32
nn.BatchNorm2d           effnet._blocks.5._bn2    1 1 input.47 755 affine=True eps=1.000000e-03 num_features=48 @bias=(48)f32 @running_mean=(48)f32 @running_var=(48)f32 @weight=(48)f32 #input.47=(1,48,16,63)f32 #755=(1,48,16,63)f32
prim::Constant           pnnx_635                 0 1 756 value=1
prim::Constant           pnnx_638                 0 1 768 value=None
prim::Constant           pnnx_639                 0 1 769 value=1
prim::Constant           pnnx_640                 0 1 770 value=0
pnnx.Attribute           effnet._blocks.6._expand_conv 0 1 weight.61 @data=(288,48,1,1)f32 #weight.61=(288,48,1,1)f32
prim::Constant           pnnx_641                 0 1 773 value=None
prim::Constant           pnnx_642                 0 1 2662 value=1
prim::ListConstruct      pnnx_643                 2 1 769 2662 774
prim::Constant           pnnx_644                 0 1 2663 value=0
prim::ListConstruct      pnnx_645                 2 1 770 2663 775
prim::Constant           pnnx_646                 0 1 2664 value=1
prim::Constant           pnnx_647                 0 1 2665 value=1
prim::ListConstruct      pnnx_648                 2 1 2664 2665 776
prim::Constant           pnnx_652                 0 1 2668 value=1
F.conv2d                 F.conv2d_52              7 1 755 weight.61 768 774 775 776 2668 input.49 $input=755 $weight=weight.61 $bias=768 $stride=774 $padding=775 $dilation=776 $groups=2668 #755=(1,48,16,63)f32 #weight.61=(288,48,1,1)f32 #input.49=(1,288,16,63)f32
nn.BatchNorm2d           effnet._blocks.6._bn0    1 1 input.49 779 affine=True eps=1.000000e-03 num_features=288 @bias=(288)f32 @running_mean=(288)f32 @running_var=(288)f32 @weight=(288)f32 #input.49=(1,288,16,63)f32 #779=(1,288,16,63)f32
nn.SiLU                  effnet._blocks.6._swish  1 1 779 780 #779=(1,288,16,63)f32 #780=(1,288,16,63)f32
prim::Constant           pnnx_659                 0 1 783 value=None
prim::Constant           pnnx_660                 0 1 784 value=1
prim::Constant           pnnx_661                 0 1 785 value=0
prim::Constant           pnnx_662                 0 1 786 value=288
pnnx.Attribute           effnet._blocks.6._depthwise_conv 0 1 weight.63 @data=(288,1,5,5)f32 #weight.63=(288,1,5,5)f32
nn.ZeroPad2d             effnet._blocks.6._depthwise_conv.static_padding 1 1 780 789 padding=(2,2,2,2) #780=(1,288,16,63)f32 #789=(1,288,20,67)f32
prim::Constant           pnnx_663                 0 1 2672 value=1
prim::ListConstruct      pnnx_664                 2 1 784 2672 790
prim::Constant           pnnx_665                 0 1 2673 value=0
prim::ListConstruct      pnnx_666                 2 1 785 2673 791
prim::Constant           pnnx_667                 0 1 2674 value=1
prim::Constant           pnnx_668                 0 1 2675 value=1
prim::ListConstruct      pnnx_669                 2 1 2674 2675 792
F.conv2d                 F.conv2d_53              7 1 789 weight.63 783 790 791 792 786 input.51 $input=789 $weight=weight.63 $bias=783 $stride=790 $padding=791 $dilation=792 $groups=786 #789=(1,288,20,67)f32 #weight.63=(288,1,5,5)f32 #input.51=(1,288,16,63)f32
nn.BatchNorm2d           effnet._blocks.6._bn1    1 1 input.51 795 affine=True eps=1.000000e-03 num_features=288 @bias=(288)f32 @running_mean=(288)f32 @running_var=(288)f32 @weight=(288)f32 #input.51=(1,288,16,63)f32 #795=(1,288,16,63)f32
nn.SiLU                  effnet._blocks.6._swish  1 1 795 796 #795=(1,288,16,63)f32 #796=(1,288,16,63)f32
prim::Constant           pnnx_677                 0 1 2681 value=1
prim::ListConstruct      pnnx_678                 2 1 756 2681 797
prim::Constant           pnnx_682                 0 1 801 value=1
prim::Constant           pnnx_683                 0 1 802 value=0
pnnx.Attribute           effnet._blocks.6._se_reduce 0 1 bias.27 @data=(12)f32 #bias.27=(12)f32
pnnx.Attribute           effnet._blocks.6._se_reduce 0 1 weight.65 @data=(12,288,1,1)f32 #weight.65=(12,288,1,1)f32
prim::Constant           pnnx_684                 0 1 806 value=None
prim::Constant           pnnx_685                 0 1 2682 value=1
prim::ListConstruct      pnnx_686                 2 1 801 2682 807
prim::Constant           pnnx_687                 0 1 2683 value=0
