7767517
1332 1331
pnnx.Input               pnnx_input_0             0 1 x.3 #x.3=(1,1,500,128)f32
pnnx.Expression          pnnx_expr_1541           0 1 165 expr=2
pnnx.Expression          pnnx_expr_1540           0 1 166 expr=3
pnnx.Expression          pnnx_expr_1539           0 1 257 expr=None
pnnx.Attribute           effnet._conv_stem        0 1 weight.3 @data=(32,1,3,3)f32 #weight.3=(32,1,3,3)f32
torch.transpose          torch.transpose_227      3 1 x.3 165 166 input.3 $input=x.3 $dim0=165 $dim1=166 #x.3=(1,1,500,128)f32 #input.3=(1,1,128,500)f32
nn.ZeroPad2d             effnet._conv_stem.static_padding 1 1 input.3 263 padding=(0,1,0,1) #input.3=(1,1,128,500)f32 #263=(1,1,129,501)f32
pnnx.Expression          pnnx_expr_1534           0 1 264 expr=[2,2]
pnnx.Expression          pnnx_expr_1532           0 1 265 expr=[0,0]
pnnx.Expression          pnnx_expr_1530           0 1 266 expr=[1,1]
pnnx.Expression          pnnx_expr_1529           0 1 2377 expr=1
F.conv2d                 F.conv2d_23              7 1 263 weight.3 257 264 265 266 2377 input0.1 $input=263 $weight=weight.3 $bias=257 $stride=264 $padding=265 $dilation=266 $groups=2377 #263=(1,1,129,501)f32 #weight.3=(32,1,3,3)f32 #input0.1=(1,32,64,250)f32
nn.BatchNorm2d           effnet._bn0              1 1 input0.1 172 affine=True eps=1.000000e-03 num_features=32 @bias=(32)f32 @running_mean=(32)f32 @running_var=(32)f32 @weight=(32)f32 #input0.1=(1,32,64,250)f32 #172=(1,32,64,250)f32
nn.SiLU                  effnet._swish            1 1 172 176 #172=(1,32,64,250)f32 #176=(1,32,64,250)f32
pnnx.Expression          pnnx_expr_1527           0 1 279 expr=None
pnnx.Expression          pnnx_expr_1524           0 1 282 expr=32
pnnx.Attribute           effnet._blocks.0._depthwise_conv 0 1 weight.5 @data=(32,1,3,3)f32 #weight.5=(32,1,3,3)f32
nn.ZeroPad2d             effnet._blocks.0._depthwise_conv.static_padding 1 1 176 285 padding=(1,1,1,1) #176=(1,32,64,250)f32 #285=(1,32,66,252)f32
pnnx.Expression          pnnx_expr_1522           0 1 286 expr=[1,1]
pnnx.Expression          pnnx_expr_1520           0 1 287 expr=[0,0]
pnnx.Expression          pnnx_expr_1517           0 1 288 expr=[1,1]
F.conv2d                 F.conv2d_24              7 1 285 weight.5 279 286 287 288 282 input.5 $input=285 $weight=weight.5 $bias=279 $stride=286 $padding=287 $dilation=288 $groups=282 #285=(1,32,66,252)f32 #weight.5=(32,1,3,3)f32 #input.5=(1,32,64,250)f32
nn.BatchNorm2d           effnet._blocks.0._bn1    1 1 input.5 291 affine=True eps=1.000000e-03 num_features=32 @bias=(32)f32 @running_mean=(32)f32 @running_var=(32)f32 @weight=(32)f32 #input.5=(1,32,64,250)f32 #291=(1,32,64,250)f32
nn.SiLU                  effnet._blocks.0._swish  1 1 291 292 #291=(1,32,64,250)f32 #292=(1,32,64,250)f32
pnnx.Expression          pnnx_expr_1515           0 1 293 expr=[1,1]
pnnx.Attribute           effnet._blocks.0._se_reduce 0 1 bias.3 @data=(8)f32 #bias.3=(8)f32
pnnx.Attribute           pnnx_unique_0            0 1 weight.7 @data=(8,32,1,1)f32 #weight.7=(8,32,1,1)f32
pnnx.Expression          pnnx_expr_1511           0 1 303 expr=[1,1]
pnnx.Expression          pnnx_expr_1509           0 1 304 expr=[0,0]
pnnx.Expression          pnnx_expr_1506           0 1 305 expr=[1,1]
pnnx.Expression          pnnx_expr_1505           0 1 2397 expr=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_0  2 1 292 293 x.5 $input=292 $output_size=293 #292=(1,32,64,250)f32 #x.5=(1,32,1,1)f32
F.conv2d                 F.conv2d_25              7 1 x.5 weight.7 bias.3 303 304 305 2397 input.7 $input=x.5 $weight=weight.7 $bias=bias.3 $stride=303 $padding=304 $dilation=305 $groups=2397 #x.5=(1,32,1,1)f32 #weight.7=(8,32,1,1)f32 #bias.3=(8)f32 #input.7=(1,8,1,1)f32
nn.SiLU                  pnnx_unique_1            1 1 input.7 308 #input.7=(1,8,1,1)f32 #308=(1,8,1,1)f32
pnnx.Attribute           effnet._blocks.0._se_expand 0 1 bias.5 @data=(32)f32 #bias.5=(32)f32
pnnx.Attribute           pnnx_unique_2            0 1 weight.9 @data=(32,8,1,1)f32 #weight.9=(32,8,1,1)f32
pnnx.Expression          pnnx_expr_1501           0 1 317 expr=[1,1]
pnnx.Expression          pnnx_expr_1499           0 1 318 expr=[0,0]
pnnx.Expression          pnnx_expr_1496           0 1 319 expr=[1,1]
pnnx.Expression          pnnx_expr_1495           0 1 2407 expr=1
F.conv2d                 F.conv2d_26              7 1 308 weight.9 bias.5 317 318 319 2407 x_squeezed.2 $input=308 $weight=weight.9 $bias=bias.5 $stride=317 $padding=318 $dilation=319 $groups=2407 #308=(1,8,1,1)f32 #weight.9=(32,8,1,1)f32 #bias.5=(32)f32 #x_squeezed.2=(1,32,1,1)f32
F.sigmoid                F.sigmoid_138            1 1 x_squeezed.2 322 $input=x_squeezed.2 #x_squeezed.2=(1,32,1,1)f32 #322=(1,32,1,1)f32
pnnx.Expression          pnnx_expr_1494           2 1 322 292 x0.2 expr=mul(@0,@1) #322=(1,32,1,1)f32 #292=(1,32,64,250)f32 #x0.2=(1,32,64,250)f32
pnnx.Expression          pnnx_expr_1493           0 1 326 expr=None
pnnx.Attribute           effnet._blocks.0._project_conv 0 1 weight.11 @data=(16,32,1,1)f32 #weight.11=(16,32,1,1)f32
pnnx.Expression          pnnx_expr_1489           0 1 332 expr=[1,1]
pnnx.Expression          pnnx_expr_1487           0 1 333 expr=[0,0]
pnnx.Expression          pnnx_expr_1484           0 1 334 expr=[1,1]
pnnx.Expression          pnnx_expr_1483           0 1 2417 expr=1
F.conv2d                 F.conv2d_27              7 1 x0.2 weight.11 326 332 333 334 2417 input.9 $input=x0.2 $weight=weight.11 $bias=326 $stride=332 $padding=333 $dilation=334 $groups=2417 #x0.2=(1,32,64,250)f32 #weight.11=(16,32,1,1)f32 #input.9=(1,16,64,250)f32
nn.BatchNorm2d           effnet._blocks.0._bn2    1 1 input.9 337 affine=True eps=1.000000e-03 num_features=16 @bias=(16)f32 @running_mean=(16)f32 @running_var=(16)f32 @weight=(16)f32 #input.9=(1,16,64,250)f32 #337=(1,16,64,250)f32
pnnx.Expression          pnnx_expr_1481           0 1 348 expr=None
pnnx.Expression          pnnx_expr_1478           0 1 351 expr=16
pnnx.Attribute           effnet._blocks.1._depthwise_conv 0 1 weight.13 @data=(16,1,3,3)f32 #weight.13=(16,1,3,3)f32
nn.ZeroPad2d             effnet._blocks.1._depthwise_conv.static_padding 1 1 337 354 padding=(1,1,1,1) #337=(1,16,64,250)f32 #354=(1,16,66,252)f32
pnnx.Expression          pnnx_expr_1476           0 1 355 expr=[1,1]
pnnx.Expression          pnnx_expr_1474           0 1 356 expr=[0,0]
pnnx.Expression          pnnx_expr_1471           0 1 357 expr=[1,1]
F.conv2d                 F.conv2d_28              7 1 354 weight.13 348 355 356 357 351 input.11 $input=354 $weight=weight.13 $bias=348 $stride=355 $padding=356 $dilation=357 $groups=351 #354=(1,16,66,252)f32 #weight.13=(16,1,3,3)f32 #input.11=(1,16,64,250)f32
nn.BatchNorm2d           effnet._blocks.1._bn1    1 1 input.11 360 affine=True eps=1.000000e-03 num_features=16 @bias=(16)f32 @running_mean=(16)f32 @running_var=(16)f32 @weight=(16)f32 #input.11=(1,16,64,250)f32 #360=(1,16,64,250)f32
nn.SiLU                  effnet._blocks.1._swish  1 1 360 361 #360=(1,16,64,250)f32 #361=(1,16,64,250)f32
pnnx.Expression          pnnx_expr_1469           0 1 362 expr=[1,1]
pnnx.Attribute           effnet._blocks.1._se_reduce 0 1 bias.7 @data=(4)f32 #bias.7=(4)f32
pnnx.Attribute           pnnx_unique_3            0 1 weight.15 @data=(4,16,1,1)f32 #weight.15=(4,16,1,1)f32
pnnx.Expression          pnnx_expr_1465           0 1 372 expr=[1,1]
pnnx.Expression          pnnx_expr_1463           0 1 373 expr=[0,0]
pnnx.Expression          pnnx_expr_1460           0 1 374 expr=[1,1]
pnnx.Expression          pnnx_expr_1459           0 1 2437 expr=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_1  2 1 361 362 x.7 $input=361 $output_size=362 #361=(1,16,64,250)f32 #x.7=(1,16,1,1)f32
F.conv2d                 F.conv2d_29              7 1 x.7 weight.15 bias.7 372 373 374 2437 input.13 $input=x.7 $weight=weight.15 $bias=bias.7 $stride=372 $padding=373 $dilation=374 $groups=2437 #x.7=(1,16,1,1)f32 #weight.15=(4,16,1,1)f32 #bias.7=(4)f32 #input.13=(1,4,1,1)f32
nn.SiLU                  pnnx_unique_4            1 1 input.13 377 #input.13=(1,4,1,1)f32 #377=(1,4,1,1)f32
pnnx.Attribute           effnet._blocks.1._se_expand 0 1 bias.9 @data=(16)f32 #bias.9=(16)f32
pnnx.Attribute           pnnx_unique_5            0 1 weight.17 @data=(16,4,1,1)f32 #weight.17=(16,4,1,1)f32
pnnx.Expression          pnnx_expr_1455           0 1 386 expr=[1,1]
pnnx.Expression          pnnx_expr_1453           0 1 387 expr=[0,0]
pnnx.Expression          pnnx_expr_1450           0 1 388 expr=[1,1]
pnnx.Expression          pnnx_expr_1449           0 1 2447 expr=1
F.conv2d                 F.conv2d_30              7 1 377 weight.17 bias.9 386 387 388 2447 x_squeezed.4 $input=377 $weight=weight.17 $bias=bias.9 $stride=386 $padding=387 $dilation=388 $groups=2447 #377=(1,4,1,1)f32 #weight.17=(16,4,1,1)f32 #bias.9=(16)f32 #x_squeezed.4=(1,16,1,1)f32
F.sigmoid                F.sigmoid_139            1 1 x_squeezed.4 391 $input=x_squeezed.4 #x_squeezed.4=(1,16,1,1)f32 #391=(1,16,1,1)f32
pnnx.Expression          pnnx_expr_1448           2 1 391 361 x0.4 expr=mul(@0,@1) #391=(1,16,1,1)f32 #361=(1,16,64,250)f32 #x0.4=(1,16,64,250)f32
pnnx.Expression          pnnx_expr_1447           0 1 395 expr=None
pnnx.Attribute           effnet._blocks.1._project_conv 0 1 weight.19 @data=(16,16,1,1)f32 #weight.19=(16,16,1,1)f32
pnnx.Expression          pnnx_expr_1443           0 1 401 expr=[1,1]
pnnx.Expression          pnnx_expr_1441           0 1 402 expr=[0,0]
pnnx.Expression          pnnx_expr_1438           0 1 403 expr=[1,1]
pnnx.Expression          pnnx_expr_1437           0 1 2457 expr=1
F.conv2d                 F.conv2d_31              7 1 x0.4 weight.19 395 401 402 403 2457 input.15 $input=x0.4 $weight=weight.19 $bias=395 $stride=401 $padding=402 $dilation=403 $groups=2457 #x0.4=(1,16,64,250)f32 #weight.19=(16,16,1,1)f32 #input.15=(1,16,64,250)f32
nn.BatchNorm2d           effnet._blocks.1._bn2    1 1 input.15 406 affine=True eps=1.000000e-03 num_features=16 @bias=(16)f32 @running_mean=(16)f32 @running_var=(16)f32 @weight=(16)f32 #input.15=(1,16,64,250)f32 #406=(1,16,64,250)f32
pnnx.Expression          pnnx_expr_1435           2 1 406 337 407 expr=add(@0,@1) #406=(1,16,64,250)f32 #337=(1,16,64,250)f32 #407=(1,16,64,250)f32
pnnx.Expression          pnnx_expr_1433           0 1 420 expr=None
pnnx.Attribute           effnet._blocks.2._expand_conv 0 1 weight.21 @data=(96,16,1,1)f32 #weight.21=(96,16,1,1)f32
pnnx.Expression          pnnx_expr_1429           0 1 426 expr=[1,1]
pnnx.Expression          pnnx_expr_1427           0 1 427 expr=[0,0]
pnnx.Expression          pnnx_expr_1424           0 1 428 expr=[1,1]
pnnx.Expression          pnnx_expr_1423           0 1 2468 expr=1
F.conv2d                 F.conv2d_32              7 1 407 weight.21 420 426 427 428 2468 input.17 $input=407 $weight=weight.21 $bias=420 $stride=426 $padding=427 $dilation=428 $groups=2468 #407=(1,16,64,250)f32 #weight.21=(96,16,1,1)f32 #input.17=(1,96,64,250)f32
nn.BatchNorm2d           effnet._blocks.2._bn0    1 1 input.17 431 affine=True eps=1.000000e-03 num_features=96 @bias=(96)f32 @running_mean=(96)f32 @running_var=(96)f32 @weight=(96)f32 #input.17=(1,96,64,250)f32 #431=(1,96,64,250)f32
nn.SiLU                  effnet._blocks.2._swish  1 1 431 432 #431=(1,96,64,250)f32 #432=(1,96,64,250)f32
pnnx.Expression          pnnx_expr_1422           0 1 435 expr=None
pnnx.Expression          pnnx_expr_1418           0 1 439 expr=96
pnnx.Attribute           effnet._blocks.2._depthwise_conv 0 1 weight.23 @data=(96,1,3,3)f32 #weight.23=(96,1,3,3)f32
nn.ZeroPad2d             effnet._blocks.2._depthwise_conv.static_padding 1 1 432 442 padding=(0,1,0,1) #432=(1,96,64,250)f32 #442=(1,96,65,251)f32
pnnx.Expression          pnnx_expr_1416           0 1 443 expr=[2,2]
pnnx.Expression          pnnx_expr_1414           0 1 444 expr=[0,0]
pnnx.Expression          pnnx_expr_1412           0 1 445 expr=[1,1]
F.conv2d                 F.conv2d_33              7 1 442 weight.23 435 443 444 445 439 input.19 $input=442 $weight=weight.23 $bias=435 $stride=443 $padding=444 $dilation=445 $groups=439 #442=(1,96,65,251)f32 #weight.23=(96,1,3,3)f32 #input.19=(1,96,32,125)f32
nn.BatchNorm2d           effnet._blocks.2._bn1    1 1 input.19 448 affine=True eps=1.000000e-03 num_features=96 @bias=(96)f32 @running_mean=(96)f32 @running_var=(96)f32 @weight=(96)f32 #input.19=(1,96,32,125)f32 #448=(1,96,32,125)f32
nn.SiLU                  pnnx_unique_6            1 1 448 449 #448=(1,96,32,125)f32 #449=(1,96,32,125)f32
pnnx.Expression          pnnx_expr_1410           0 1 450 expr=[1,1]
pnnx.Attribute           effnet._blocks.2._se_reduce 0 1 bias.11 @data=(4)f32 #bias.11=(4)f32
pnnx.Attribute           pnnx_unique_7            0 1 weight.25 @data=(4,96,1,1)f32 #weight.25=(4,96,1,1)f32
pnnx.Expression          pnnx_expr_1406           0 1 460 expr=[1,1]
pnnx.Expression          pnnx_expr_1404           0 1 461 expr=[0,0]
pnnx.Expression          pnnx_expr_1401           0 1 462 expr=[1,1]
pnnx.Expression          pnnx_expr_1400           0 1 2487 expr=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_2  2 1 449 450 x.9 $input=449 $output_size=450 #449=(1,96,32,125)f32 #x.9=(1,96,1,1)f32
F.conv2d                 F.conv2d_34              7 1 x.9 weight.25 bias.11 460 461 462 2487 input.21 $input=x.9 $weight=weight.25 $bias=bias.11 $stride=460 $padding=461 $dilation=462 $groups=2487 #x.9=(1,96,1,1)f32 #weight.25=(4,96,1,1)f32 #bias.11=(4)f32 #input.21=(1,4,1,1)f32
nn.SiLU                  pnnx_unique_8            1 1 input.21 465 #input.21=(1,4,1,1)f32 #465=(1,4,1,1)f32
pnnx.Attribute           effnet._blocks.2._se_expand 0 1 bias.13 @data=(96)f32 #bias.13=(96)f32
pnnx.Attribute           pnnx_unique_9            0 1 weight.27 @data=(96,4,1,1)f32 #weight.27=(96,4,1,1)f32
pnnx.Expression          pnnx_expr_1396           0 1 474 expr=[1,1]
pnnx.Expression          pnnx_expr_1394           0 1 475 expr=[0,0]
pnnx.Expression          pnnx_expr_1391           0 1 476 expr=[1,1]
pnnx.Expression          pnnx_expr_1390           0 1 2497 expr=1
F.conv2d                 F.conv2d_35              7 1 465 weight.27 bias.13 474 475 476 2497 x_squeezed.6 $input=465 $weight=weight.27 $bias=bias.13 $stride=474 $padding=475 $dilation=476 $groups=2497 #465=(1,4,1,1)f32 #weight.27=(96,4,1,1)f32 #bias.13=(96)f32 #x_squeezed.6=(1,96,1,1)f32
F.sigmoid                F.sigmoid_140            1 1 x_squeezed.6 479 $input=x_squeezed.6 #x_squeezed.6=(1,96,1,1)f32 #479=(1,96,1,1)f32
pnnx.Expression          pnnx_expr_1389           2 1 479 449 x0.6 expr=mul(@0,@1) #479=(1,96,1,1)f32 #449=(1,96,32,125)f32 #x0.6=(1,96,32,125)f32
pnnx.Expression          pnnx_expr_1388           0 1 483 expr=None
pnnx.Attribute           effnet._blocks.2._project_conv 0 1 weight.29 @data=(24,96,1,1)f32 #weight.29=(24,96,1,1)f32
pnnx.Expression          pnnx_expr_1384           0 1 489 expr=[1,1]
pnnx.Expression          pnnx_expr_1382           0 1 490 expr=[0,0]
pnnx.Expression          pnnx_expr_1379           0 1 491 expr=[1,1]
pnnx.Expression          pnnx_expr_1378           0 1 2507 expr=1
F.conv2d                 F.conv2d_36              7 1 x0.6 weight.29 483 489 490 491 2507 input.23 $input=x0.6 $weight=weight.29 $bias=483 $stride=489 $padding=490 $dilation=491 $groups=2507 #x0.6=(1,96,32,125)f32 #weight.29=(24,96,1,1)f32 #input.23=(1,24,32,125)f32
nn.BatchNorm2d           effnet._blocks.2._bn2    1 1 input.23 494 affine=True eps=1.000000e-03 num_features=24 @bias=(24)f32 @running_mean=(24)f32 @running_var=(24)f32 @weight=(24)f32 #input.23=(1,24,32,125)f32 #494=(1,24,32,125)f32
pnnx.Expression          pnnx_expr_1376           0 1 507 expr=None
pnnx.Attribute           effnet._blocks.3._expand_conv 0 1 weight.31 @data=(144,24,1,1)f32 #weight.31=(144,24,1,1)f32
pnnx.Expression          pnnx_expr_1372           0 1 513 expr=[1,1]
pnnx.Expression          pnnx_expr_1370           0 1 514 expr=[0,0]
pnnx.Expression          pnnx_expr_1367           0 1 515 expr=[1,1]
pnnx.Expression          pnnx_expr_1366           0 1 2517 expr=1
F.conv2d                 F.conv2d_37              7 1 494 weight.31 507 513 514 515 2517 input.25 $input=494 $weight=weight.31 $bias=507 $stride=513 $padding=514 $dilation=515 $groups=2517 #494=(1,24,32,125)f32 #weight.31=(144,24,1,1)f32 #input.25=(1,144,32,125)f32
nn.BatchNorm2d           effnet._blocks.3._bn0    1 1 input.25 518 affine=True eps=1.000000e-03 num_features=144 @bias=(144)f32 @running_mean=(144)f32 @running_var=(144)f32 @weight=(144)f32 #input.25=(1,144,32,125)f32 #518=(1,144,32,125)f32
nn.SiLU                  effnet._blocks.3._swish  1 1 518 519 #518=(1,144,32,125)f32 #519=(1,144,32,125)f32
pnnx.Expression          pnnx_expr_1365           0 1 522 expr=None
pnnx.Expression          pnnx_expr_1362           0 1 525 expr=144
pnnx.Attribute           effnet._blocks.3._depthwise_conv 0 1 weight.33 @data=(144,1,3,3)f32 #weight.33=(144,1,3,3)f32
nn.ZeroPad2d             effnet._blocks.3._depthwise_conv.static_padding 1 1 519 528 padding=(1,1,1,1) #519=(1,144,32,125)f32 #528=(1,144,34,127)f32
pnnx.Expression          pnnx_expr_1360           0 1 529 expr=[1,1]
pnnx.Expression          pnnx_expr_1358           0 1 530 expr=[0,0]
pnnx.Expression          pnnx_expr_1355           0 1 531 expr=[1,1]
F.conv2d                 F.conv2d_38              7 1 528 weight.33 522 529 530 531 525 input.27 $input=528 $weight=weight.33 $bias=522 $stride=529 $padding=530 $dilation=531 $groups=525 #528=(1,144,34,127)f32 #weight.33=(144,1,3,3)f32 #input.27=(1,144,32,125)f32
nn.BatchNorm2d           effnet._blocks.3._bn1    1 1 input.27 534 affine=True eps=1.000000e-03 num_features=144 @bias=(144)f32 @running_mean=(144)f32 @running_var=(144)f32 @weight=(144)f32 #input.27=(1,144,32,125)f32 #534=(1,144,32,125)f32
nn.SiLU                  pnnx_unique_10           1 1 534 535 #534=(1,144,32,125)f32 #535=(1,144,32,125)f32
pnnx.Expression          pnnx_expr_1353           0 1 536 expr=[1,1]
pnnx.Attribute           effnet._blocks.3._se_reduce 0 1 bias.15 @data=(6)f32 #bias.15=(6)f32
pnnx.Attribute           pnnx_unique_11           0 1 weight.35 @data=(6,144,1,1)f32 #weight.35=(6,144,1,1)f32
pnnx.Expression          pnnx_expr_1349           0 1 546 expr=[1,1]
pnnx.Expression          pnnx_expr_1347           0 1 547 expr=[0,0]
pnnx.Expression          pnnx_expr_1344           0 1 548 expr=[1,1]
pnnx.Expression          pnnx_expr_1343           0 1 2537 expr=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_3  2 1 535 536 x.11 $input=535 $output_size=536 #535=(1,144,32,125)f32 #x.11=(1,144,1,1)f32
F.conv2d                 F.conv2d_39              7 1 x.11 weight.35 bias.15 546 547 548 2537 input.29 $input=x.11 $weight=weight.35 $bias=bias.15 $stride=546 $padding=547 $dilation=548 $groups=2537 #x.11=(1,144,1,1)f32 #weight.35=(6,144,1,1)f32 #bias.15=(6)f32 #input.29=(1,6,1,1)f32
nn.SiLU                  pnnx_unique_12           1 1 input.29 551 #input.29=(1,6,1,1)f32 #551=(1,6,1,1)f32
pnnx.Attribute           effnet._blocks.3._se_expand 0 1 bias.17 @data=(144)f32 #bias.17=(144)f32
pnnx.Attribute           pnnx_unique_13           0 1 weight.37 @data=(144,6,1,1)f32 #weight.37=(144,6,1,1)f32
pnnx.Expression          pnnx_expr_1339           0 1 560 expr=[1,1]
pnnx.Expression          pnnx_expr_1337           0 1 561 expr=[0,0]
pnnx.Expression          pnnx_expr_1334           0 1 562 expr=[1,1]
pnnx.Expression          pnnx_expr_1333           0 1 2547 expr=1
F.conv2d                 F.conv2d_40              7 1 551 weight.37 bias.17 560 561 562 2547 x_squeezed.8 $input=551 $weight=weight.37 $bias=bias.17 $stride=560 $padding=561 $dilation=562 $groups=2547 #551=(1,6,1,1)f32 #weight.37=(144,6,1,1)f32 #bias.17=(144)f32 #x_squeezed.8=(1,144,1,1)f32
F.sigmoid                F.sigmoid_141            1 1 x_squeezed.8 565 $input=x_squeezed.8 #x_squeezed.8=(1,144,1,1)f32 #565=(1,144,1,1)f32
pnnx.Expression          pnnx_expr_1332           2 1 565 535 x0.8 expr=mul(@0,@1) #565=(1,144,1,1)f32 #535=(1,144,32,125)f32 #x0.8=(1,144,32,125)f32
pnnx.Expression          pnnx_expr_1331           0 1 569 expr=None
pnnx.Attribute           effnet._blocks.3._project_conv 0 1 weight.39 @data=(24,144,1,1)f32 #weight.39=(24,144,1,1)f32
pnnx.Expression          pnnx_expr_1327           0 1 575 expr=[1,1]
pnnx.Expression          pnnx_expr_1325           0 1 576 expr=[0,0]
pnnx.Expression          pnnx_expr_1322           0 1 577 expr=[1,1]
pnnx.Expression          pnnx_expr_1321           0 1 2557 expr=1
F.conv2d                 F.conv2d_41              7 1 x0.8 weight.39 569 575 576 577 2557 input.31 $input=x0.8 $weight=weight.39 $bias=569 $stride=575 $padding=576 $dilation=577 $groups=2557 #x0.8=(1,144,32,125)f32 #weight.39=(24,144,1,1)f32 #input.31=(1,24,32,125)f32
nn.BatchNorm2d           effnet._blocks.3._bn2    1 1 input.31 580 affine=True eps=1.000000e-03 num_features=24 @bias=(24)f32 @running_mean=(24)f32 @running_var=(24)f32 @weight=(24)f32 #input.31=(1,24,32,125)f32 #580=(1,24,32,125)f32
pnnx.Expression          pnnx_expr_1319           2 1 580 494 581 expr=add(@0,@1) #580=(1,24,32,125)f32 #494=(1,24,32,125)f32 #581=(1,24,32,125)f32
pnnx.Expression          pnnx_expr_1317           0 1 594 expr=None
pnnx.Attribute           effnet._blocks.4._expand_conv 0 1 weight.41 @data=(144,24,1,1)f32 #weight.41=(144,24,1,1)f32
pnnx.Expression          pnnx_expr_1313           0 1 600 expr=[1,1]
pnnx.Expression          pnnx_expr_1311           0 1 601 expr=[0,0]
pnnx.Expression          pnnx_expr_1308           0 1 602 expr=[1,1]
pnnx.Expression          pnnx_expr_1307           0 1 2568 expr=1
F.conv2d                 F.conv2d_42              7 1 581 weight.41 594 600 601 602 2568 input.33 $input=581 $weight=weight.41 $bias=594 $stride=600 $padding=601 $dilation=602 $groups=2568 #581=(1,24,32,125)f32 #weight.41=(144,24,1,1)f32 #input.33=(1,144,32,125)f32
nn.BatchNorm2d           effnet._blocks.4._bn0    1 1 input.33 605 affine=True eps=1.000000e-03 num_features=144 @bias=(144)f32 @running_mean=(144)f32 @running_var=(144)f32 @weight=(144)f32 #input.33=(1,144,32,125)f32 #605=(1,144,32,125)f32
nn.SiLU                  effnet._blocks.4._swish  1 1 605 606 #605=(1,144,32,125)f32 #606=(1,144,32,125)f32
pnnx.Expression          pnnx_expr_1306           0 1 609 expr=None
pnnx.Expression          pnnx_expr_1303           0 1 612 expr=144
pnnx.Attribute           effnet._blocks.4._depthwise_conv 0 1 weight.43 @data=(144,1,3,3)f32 #weight.43=(144,1,3,3)f32
nn.ZeroPad2d             effnet._blocks.4._depthwise_conv.static_padding 1 1 606 615 padding=(1,1,1,1) #606=(1,144,32,125)f32 #615=(1,144,34,127)f32
pnnx.Expression          pnnx_expr_1301           0 1 616 expr=[1,1]
pnnx.Expression          pnnx_expr_1299           0 1 617 expr=[0,0]
pnnx.Expression          pnnx_expr_1296           0 1 618 expr=[1,1]
F.conv2d                 F.conv2d_43              7 1 615 weight.43 609 616 617 618 612 input.35 $input=615 $weight=weight.43 $bias=609 $stride=616 $padding=617 $dilation=618 $groups=612 #615=(1,144,34,127)f32 #weight.43=(144,1,3,3)f32 #input.35=(1,144,32,125)f32
nn.BatchNorm2d           effnet._blocks.4._bn1    1 1 input.35 621 affine=True eps=1.000000e-03 num_features=144 @bias=(144)f32 @running_mean=(144)f32 @running_var=(144)f32 @weight=(144)f32 #input.35=(1,144,32,125)f32 #621=(1,144,32,125)f32
nn.SiLU                  pnnx_unique_14           1 1 621 622 #621=(1,144,32,125)f32 #622=(1,144,32,125)f32
pnnx.Expression          pnnx_expr_1294           0 1 623 expr=[1,1]
pnnx.Attribute           effnet._blocks.4._se_reduce 0 1 bias.19 @data=(6)f32 #bias.19=(6)f32
pnnx.Attribute           pnnx_unique_15           0 1 weight.45 @data=(6,144,1,1)f32 #weight.45=(6,144,1,1)f32
pnnx.Expression          pnnx_expr_1290           0 1 633 expr=[1,1]
pnnx.Expression          pnnx_expr_1288           0 1 634 expr=[0,0]
pnnx.Expression          pnnx_expr_1285           0 1 635 expr=[1,1]
pnnx.Expression          pnnx_expr_1284           0 1 2588 expr=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_4  2 1 622 623 x.13 $input=622 $output_size=623 #622=(1,144,32,125)f32 #x.13=(1,144,1,1)f32
F.conv2d                 F.conv2d_44              7 1 x.13 weight.45 bias.19 633 634 635 2588 input.37 $input=x.13 $weight=weight.45 $bias=bias.19 $stride=633 $padding=634 $dilation=635 $groups=2588 #x.13=(1,144,1,1)f32 #weight.45=(6,144,1,1)f32 #bias.19=(6)f32 #input.37=(1,6,1,1)f32
nn.SiLU                  pnnx_unique_16           1 1 input.37 638 #input.37=(1,6,1,1)f32 #638=(1,6,1,1)f32
pnnx.Attribute           effnet._blocks.4._se_expand 0 1 bias.21 @data=(144)f32 #bias.21=(144)f32
pnnx.Attribute           pnnx_unique_17           0 1 weight.47 @data=(144,6,1,1)f32 #weight.47=(144,6,1,1)f32
pnnx.Expression          pnnx_expr_1280           0 1 647 expr=[1,1]
pnnx.Expression          pnnx_expr_1278           0 1 648 expr=[0,0]
pnnx.Expression          pnnx_expr_1275           0 1 649 expr=[1,1]
pnnx.Expression          pnnx_expr_1274           0 1 2598 expr=1
F.conv2d                 F.conv2d_45              7 1 638 weight.47 bias.21 647 648 649 2598 x_squeezed.10 $input=638 $weight=weight.47 $bias=bias.21 $stride=647 $padding=648 $dilation=649 $groups=2598 #638=(1,6,1,1)f32 #weight.47=(144,6,1,1)f32 #bias.21=(144)f32 #x_squeezed.10=(1,144,1,1)f32
F.sigmoid                F.sigmoid_142            1 1 x_squeezed.10 652 $input=x_squeezed.10 #x_squeezed.10=(1,144,1,1)f32 #652=(1,144,1,1)f32
pnnx.Expression          pnnx_expr_1273           2 1 652 622 x0.10 expr=mul(@0,@1) #652=(1,144,1,1)f32 #622=(1,144,32,125)f32 #x0.10=(1,144,32,125)f32
pnnx.Expression          pnnx_expr_1272           0 1 656 expr=None
pnnx.Attribute           effnet._blocks.4._project_conv 0 1 weight.49 @data=(24,144,1,1)f32 #weight.49=(24,144,1,1)f32
pnnx.Expression          pnnx_expr_1268           0 1 662 expr=[1,1]
pnnx.Expression          pnnx_expr_1266           0 1 663 expr=[0,0]
pnnx.Expression          pnnx_expr_1263           0 1 664 expr=[1,1]
pnnx.Expression          pnnx_expr_1262           0 1 2608 expr=1
F.conv2d                 F.conv2d_46              7 1 x0.10 weight.49 656 662 663 664 2608 input.39 $input=x0.10 $weight=weight.49 $bias=656 $stride=662 $padding=663 $dilation=664 $groups=2608 #x0.10=(1,144,32,125)f32 #weight.49=(24,144,1,1)f32 #input.39=(1,24,32,125)f32
nn.BatchNorm2d           effnet._blocks.4._bn2    1 1 input.39 667 affine=True eps=1.000000e-03 num_features=24 @bias=(24)f32 @running_mean=(24)f32 @running_var=(24)f32 @weight=(24)f32 #input.39=(1,24,32,125)f32 #667=(1,24,32,125)f32
pnnx.Expression          pnnx_expr_1260           2 1 667 581 668 expr=add(@0,@1) #667=(1,24,32,125)f32 #581=(1,24,32,125)f32 #668=(1,24,32,125)f32
pnnx.Expression          pnnx_expr_1258           0 1 681 expr=None
pnnx.Attribute           effnet._blocks.5._expand_conv 0 1 weight.51 @data=(144,24,1,1)f32 #weight.51=(144,24,1,1)f32
pnnx.Expression          pnnx_expr_1254           0 1 687 expr=[1,1]
pnnx.Expression          pnnx_expr_1252           0 1 688 expr=[0,0]
pnnx.Expression          pnnx_expr_1249           0 1 689 expr=[1,1]
pnnx.Expression          pnnx_expr_1248           0 1 2619 expr=1
F.conv2d                 F.conv2d_47              7 1 668 weight.51 681 687 688 689 2619 input.41 $input=668 $weight=weight.51 $bias=681 $stride=687 $padding=688 $dilation=689 $groups=2619 #668=(1,24,32,125)f32 #weight.51=(144,24,1,1)f32 #input.41=(1,144,32,125)f32
nn.BatchNorm2d           effnet._blocks.5._bn0    1 1 input.41 692 affine=True eps=1.000000e-03 num_features=144 @bias=(144)f32 @running_mean=(144)f32 @running_var=(144)f32 @weight=(144)f32 #input.41=(1,144,32,125)f32 #692=(1,144,32,125)f32
nn.SiLU                  effnet._blocks.5._swish  1 1 692 693 #692=(1,144,32,125)f32 #693=(1,144,32,125)f32
pnnx.Expression          pnnx_expr_1247           0 1 696 expr=None
pnnx.Expression          pnnx_expr_1243           0 1 700 expr=144
pnnx.Attribute           effnet._blocks.5._depthwise_conv 0 1 weight.53 @data=(144,1,5,5)f32 #weight.53=(144,1,5,5)f32
nn.ZeroPad2d             effnet._blocks.5._depthwise_conv.static_padding 1 1 693 703 padding=(2,2,2,2) #693=(1,144,32,125)f32 #703=(1,144,36,129)f32
pnnx.Expression          pnnx_expr_1241           0 1 704 expr=[2,2]
pnnx.Expression          pnnx_expr_1239           0 1 705 expr=[0,0]
pnnx.Expression          pnnx_expr_1237           0 1 706 expr=[1,1]
F.conv2d                 F.conv2d_48              7 1 703 weight.53 696 704 705 706 700 input.43 $input=703 $weight=weight.53 $bias=696 $stride=704 $padding=705 $dilation=706 $groups=700 #703=(1,144,36,129)f32 #weight.53=(144,1,5,5)f32 #input.43=(1,144,16,63)f32
nn.BatchNorm2d           effnet._blocks.5._bn1    1 1 input.43 709 affine=True eps=1.000000e-03 num_features=144 @bias=(144)f32 @running_mean=(144)f32 @running_var=(144)f32 @weight=(144)f32 #input.43=(1,144,16,63)f32 #709=(1,144,16,63)f32
nn.SiLU                  pnnx_unique_18           1 1 709 710 #709=(1,144,16,63)f32 #710=(1,144,16,63)f32
pnnx.Expression          pnnx_expr_1235           0 1 711 expr=[1,1]
pnnx.Attribute           effnet._blocks.5._se_reduce 0 1 bias.23 @data=(6)f32 #bias.23=(6)f32
pnnx.Attribute           pnnx_unique_19           0 1 weight.55 @data=(6,144,1,1)f32 #weight.55=(6,144,1,1)f32
pnnx.Expression          pnnx_expr_1231           0 1 721 expr=[1,1]
pnnx.Expression          pnnx_expr_1229           0 1 722 expr=[0,0]
pnnx.Expression          pnnx_expr_1226           0 1 723 expr=[1,1]
pnnx.Expression          pnnx_expr_1225           0 1 2638 expr=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_5  2 1 710 711 x.15 $input=710 $output_size=711 #710=(1,144,16,63)f32 #x.15=(1,144,1,1)f32
F.conv2d                 F.conv2d_49              7 1 x.15 weight.55 bias.23 721 722 723 2638 input.45 $input=x.15 $weight=weight.55 $bias=bias.23 $stride=721 $padding=722 $dilation=723 $groups=2638 #x.15=(1,144,1,1)f32 #weight.55=(6,144,1,1)f32 #bias.23=(6)f32 #input.45=(1,6,1,1)f32
nn.SiLU                  pnnx_unique_20           1 1 input.45 726 #input.45=(1,6,1,1)f32 #726=(1,6,1,1)f32
pnnx.Attribute           effnet._blocks.5._se_expand 0 1 bias.25 @data=(144)f32 #bias.25=(144)f32
pnnx.Attribute           pnnx_unique_21           0 1 weight.57 @data=(144,6,1,1)f32 #weight.57=(144,6,1,1)f32
pnnx.Expression          pnnx_expr_1221           0 1 735 expr=[1,1]
pnnx.Expression          pnnx_expr_1219           0 1 736 expr=[0,0]
pnnx.Expression          pnnx_expr_1216           0 1 737 expr=[1,1]
pnnx.Expression          pnnx_expr_1215           0 1 2648 expr=1
F.conv2d                 F.conv2d_50              7 1 726 weight.57 bias.25 735 736 737 2648 x_squeezed.12 $input=726 $weight=weight.57 $bias=bias.25 $stride=735 $padding=736 $dilation=737 $groups=2648 #726=(1,6,1,1)f32 #weight.57=(144,6,1,1)f32 #bias.25=(144)f32 #x_squeezed.12=(1,144,1,1)f32
F.sigmoid                F.sigmoid_143            1 1 x_squeezed.12 740 $input=x_squeezed.12 #x_squeezed.12=(1,144,1,1)f32 #740=(1,144,1,1)f32
pnnx.Expression          pnnx_expr_1214           2 1 740 710 x0.12 expr=mul(@0,@1) #740=(1,144,1,1)f32 #710=(1,144,16,63)f32 #x0.12=(1,144,16,63)f32
pnnx.Expression          pnnx_expr_1213           0 1 744 expr=None
pnnx.Attribute           effnet._blocks.5._project_conv 0 1 weight.59 @data=(48,144,1,1)f32 #weight.59=(48,144,1,1)f32
pnnx.Expression          pnnx_expr_1209           0 1 750 expr=[1,1]
pnnx.Expression          pnnx_expr_1207           0 1 751 expr=[0,0]
pnnx.Expression          pnnx_expr_1204           0 1 752 expr=[1,1]
pnnx.Expression          pnnx_expr_1203           0 1 2658 expr=1
F.conv2d                 F.conv2d_51              7 1 x0.12 weight.59 744 750 751 752 2658 input.47 $input=x0.12 $weight=weight.59 $bias=744 $stride=750 $padding=751 $dilation=752 $groups=2658 #x0.12=(1,144,16,63)f32 #weight.59=(48,144,1,1)f32 #input.47=(1,48,16,63)f32
nn.BatchNorm2d           effnet._blocks.5._bn2    1 1 input.47 755 affine=True eps=1.000000e-03 num_features=48 @bias=(48)f32 @running_mean=(48)f32 @running_var=(48)f32 @weight=(48)f32 #input.47=(1,48,16,63)f32 #755=(1,48,16,63)f32
pnnx.Expression          pnnx_expr_1201           0 1 768 expr=None
pnnx.Attribute           effnet._blocks.6._expand_conv 0 1 weight.61 @data=(288,48,1,1)f32 #weight.61=(288,48,1,1)f32
pnnx.Expression          pnnx_expr_1197           0 1 774 expr=[1,1]
pnnx.Expression          pnnx_expr_1195           0 1 775 expr=[0,0]
pnnx.Expression          pnnx_expr_1192           0 1 776 expr=[1,1]
pnnx.Expression          pnnx_expr_1191           0 1 2668 expr=1
F.conv2d                 F.conv2d_52              7 1 755 weight.61 768 774 775 776 2668 input.49 $input=755 $weight=weight.61 $bias=768 $stride=774 $padding=775 $dilation=776 $groups=2668 #755=(1,48,16,63)f32 #weight.61=(288,48,1,1)f32 #input.49=(1,288,16,63)f32
nn.BatchNorm2d           effnet._blocks.6._bn0    1 1 input.49 779 affine=True eps=1.000000e-03 num_features=288 @bias=(288)f32 @running_mean=(288)f32 @running_var=(288)f32 @weight=(288)f32 #input.49=(1,288,16,63)f32 #779=(1,288,16,63)f32
nn.SiLU                  effnet._blocks.6._swish  1 1 779 780 #779=(1,288,16,63)f32 #780=(1,288,16,63)f32
pnnx.Expression          pnnx_expr_1190           0 1 783 expr=None
pnnx.Expression          pnnx_expr_1187           0 1 786 expr=288
pnnx.Attribute           effnet._blocks.6._depthwise_conv 0 1 weight.63 @data=(288,1,5,5)f32 #weight.63=(288,1,5,5)f32
nn.ZeroPad2d             effnet._blocks.6._depthwise_conv.static_padding 1 1 780 789 padding=(2,2,2,2) #780=(1,288,16,63)f32 #789=(1,288,20,67)f32
pnnx.Expression          pnnx_expr_1185           0 1 790 expr=[1,1]
pnnx.Expression          pnnx_expr_1183           0 1 791 expr=[0,0]
pnnx.Expression          pnnx_expr_1180           0 1 792 expr=[1,1]
F.conv2d                 F.conv2d_53              7 1 789 weight.63 783 790 791 792 786 input.51 $input=789 $weight=weight.63 $bias=783 $stride=790 $padding=791 $dilation=792 $groups=786 #789=(1,288,20,67)f32 #weight.63=(288,1,5,5)f32 #input.51=(1,288,16,63)f32
nn.BatchNorm2d           effnet._blocks.6._bn1    1 1 input.51 795 affine=True eps=1.000000e-03 num_features=288 @bias=(288)f32 @running_mean=(288)f32 @running_var=(288)f32 @weight=(288)f32 #input.51=(1,288,16,63)f32 #795=(1,288,16,63)f32
nn.SiLU                  pnnx_unique_22           1 1 795 796 #795=(1,288,16,63)f32 #796=(1,288,16,63)f32
pnnx.Expression          pnnx_expr_1178           0 1 797 expr=[1,1]
pnnx.Attribute           effnet._blocks.6._se_reduce 0 1 bias.27 @data=(12)f32 #bias.27=(12)f32
pnnx.Attribute           pnnx_unique_23           0 1 weight.65 @data=(12,288,1,1)f32 #weight.65=(12,288,1,1)f32
pnnx.Expression          pnnx_expr_1174           0 1 807 expr=[1,1]
pnnx.Expression          pnnx_expr_1172           0 1 808 expr=[0,0]
pnnx.Expression          pnnx_expr_1169           0 1 809 expr=[1,1]
pnnx.Expression          pnnx_expr_1168           0 1 2688 expr=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_6  2 1 796 797 x.17 $input=796 $output_size=797 #796=(1,288,16,63)f32 #x.17=(1,288,1,1)f32
F.conv2d                 F.conv2d_54              7 1 x.17 weight.65 bias.27 807 808 809 2688 input.53 $input=x.17 $weight=weight.65 $bias=bias.27 $stride=807 $padding=808 $dilation=809 $groups=2688 #x.17=(1,288,1,1)f32 #weight.65=(12,288,1,1)f32 #bias.27=(12)f32 #input.53=(1,12,1,1)f32
nn.SiLU                  pnnx_unique_24           1 1 input.53 812 #input.53=(1,12,1,1)f32 #812=(1,12,1,1)f32
pnnx.Attribute           effnet._blocks.6._se_expand 0 1 bias.29 @data=(288)f32 #bias.29=(288)f32
pnnx.Attribute           pnnx_unique_25           0 1 weight.67 @data=(288,12,1,1)f32 #weight.67=(288,12,1,1)f32
pnnx.Expression          pnnx_expr_1164           0 1 821 expr=[1,1]
pnnx.Expression          pnnx_expr_1162           0 1 822 expr=[0,0]
pnnx.Expression          pnnx_expr_1159           0 1 823 expr=[1,1]
pnnx.Expression          pnnx_expr_1158           0 1 2698 expr=1
F.conv2d                 F.conv2d_55              7 1 812 weight.67 bias.29 821 822 823 2698 x_squeezed.14 $input=812 $weight=weight.67 $bias=bias.29 $stride=821 $padding=822 $dilation=823 $groups=2698 #812=(1,12,1,1)f32 #weight.67=(288,12,1,1)f32 #bias.29=(288)f32 #x_squeezed.14=(1,288,1,1)f32
F.sigmoid                F.sigmoid_144            1 1 x_squeezed.14 826 $input=x_squeezed.14 #x_squeezed.14=(1,288,1,1)f32 #826=(1,288,1,1)f32
pnnx.Expression          pnnx_expr_1157           2 1 826 796 x0.14 expr=mul(@0,@1) #826=(1,288,1,1)f32 #796=(1,288,16,63)f32 #x0.14=(1,288,16,63)f32
pnnx.Expression          pnnx_expr_1156           0 1 830 expr=None
pnnx.Attribute           effnet._blocks.6._project_conv 0 1 weight.69 @data=(48,288,1,1)f32 #weight.69=(48,288,1,1)f32
pnnx.Expression          pnnx_expr_1152           0 1 836 expr=[1,1]
pnnx.Expression          pnnx_expr_1150           0 1 837 expr=[0,0]
pnnx.Expression          pnnx_expr_1147           0 1 838 expr=[1,1]
pnnx.Expression          pnnx_expr_1146           0 1 2708 expr=1
F.conv2d                 F.conv2d_56              7 1 x0.14 weight.69 830 836 837 838 2708 input.55 $input=x0.14 $weight=weight.69 $bias=830 $stride=836 $padding=837 $dilation=838 $groups=2708 #x0.14=(1,288,16,63)f32 #weight.69=(48,288,1,1)f32 #input.55=(1,48,16,63)f32
nn.BatchNorm2d           effnet._blocks.6._bn2    1 1 input.55 841 affine=True eps=1.000000e-03 num_features=48 @bias=(48)f32 @running_mean=(48)f32 @running_var=(48)f32 @weight=(48)f32 #input.55=(1,48,16,63)f32 #841=(1,48,16,63)f32
pnnx.Expression          pnnx_expr_1144           2 1 841 755 842 expr=add(@0,@1) #841=(1,48,16,63)f32 #755=(1,48,16,63)f32 #842=(1,48,16,63)f32
pnnx.Expression          pnnx_expr_1142           0 1 855 expr=None
pnnx.Attribute           effnet._blocks.7._expand_conv 0 1 weight.71 @data=(288,48,1,1)f32 #weight.71=(288,48,1,1)f32
pnnx.Expression          pnnx_expr_1138           0 1 861 expr=[1,1]
pnnx.Expression          pnnx_expr_1136           0 1 862 expr=[0,0]
pnnx.Expression          pnnx_expr_1133           0 1 863 expr=[1,1]
pnnx.Expression          pnnx_expr_1132           0 1 2719 expr=1
F.conv2d                 F.conv2d_57              7 1 842 weight.71 855 861 862 863 2719 input.57 $input=842 $weight=weight.71 $bias=855 $stride=861 $padding=862 $dilation=863 $groups=2719 #842=(1,48,16,63)f32 #weight.71=(288,48,1,1)f32 #input.57=(1,288,16,63)f32
nn.BatchNorm2d           effnet._blocks.7._bn0    1 1 input.57 866 affine=True eps=1.000000e-03 num_features=288 @bias=(288)f32 @running_mean=(288)f32 @running_var=(288)f32 @weight=(288)f32 #input.57=(1,288,16,63)f32 #866=(1,288,16,63)f32
nn.SiLU                  effnet._blocks.7._swish  1 1 866 867 #866=(1,288,16,63)f32 #867=(1,288,16,63)f32
pnnx.Expression          pnnx_expr_1131           0 1 870 expr=None
pnnx.Expression          pnnx_expr_1128           0 1 873 expr=288
pnnx.Attribute           effnet._blocks.7._depthwise_conv 0 1 weight.73 @data=(288,1,5,5)f32 #weight.73=(288,1,5,5)f32
nn.ZeroPad2d             effnet._blocks.7._depthwise_conv.static_padding 1 1 867 876 padding=(2,2,2,2) #867=(1,288,16,63)f32 #876=(1,288,20,67)f32
pnnx.Expression          pnnx_expr_1126           0 1 877 expr=[1,1]
pnnx.Expression          pnnx_expr_1124           0 1 878 expr=[0,0]
pnnx.Expression          pnnx_expr_1121           0 1 879 expr=[1,1]
F.conv2d                 F.conv2d_58              7 1 876 weight.73 870 877 878 879 873 input.59 $input=876 $weight=weight.73 $bias=870 $stride=877 $padding=878 $dilation=879 $groups=873 #876=(1,288,20,67)f32 #weight.73=(288,1,5,5)f32 #input.59=(1,288,16,63)f32
nn.BatchNorm2d           effnet._blocks.7._bn1    1 1 input.59 882 affine=True eps=1.000000e-03 num_features=288 @bias=(288)f32 @running_mean=(288)f32 @running_var=(288)f32 @weight=(288)f32 #input.59=(1,288,16,63)f32 #882=(1,288,16,63)f32
nn.SiLU                  pnnx_unique_26           1 1 882 883 #882=(1,288,16,63)f32 #883=(1,288,16,63)f32
pnnx.Expression          pnnx_expr_1119           0 1 884 expr=[1,1]
pnnx.Attribute           effnet._blocks.7._se_reduce 0 1 bias.31 @data=(12)f32 #bias.31=(12)f32
pnnx.Attribute           pnnx_unique_27           0 1 weight.75 @data=(12,288,1,1)f32 #weight.75=(12,288,1,1)f32
pnnx.Expression          pnnx_expr_1115           0 1 894 expr=[1,1]
pnnx.Expression          pnnx_expr_1113           0 1 895 expr=[0,0]
pnnx.Expression          pnnx_expr_1110           0 1 896 expr=[1,1]
pnnx.Expression          pnnx_expr_1109           0 1 2739 expr=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_7  2 1 883 884 x.19 $input=883 $output_size=884 #883=(1,288,16,63)f32 #x.19=(1,288,1,1)f32
F.conv2d                 F.conv2d_59              7 1 x.19 weight.75 bias.31 894 895 896 2739 input.61 $input=x.19 $weight=weight.75 $bias=bias.31 $stride=894 $padding=895 $dilation=896 $groups=2739 #x.19=(1,288,1,1)f32 #weight.75=(12,288,1,1)f32 #bias.31=(12)f32 #input.61=(1,12,1,1)f32
nn.SiLU                  pnnx_unique_28           1 1 input.61 899 #input.61=(1,12,1,1)f32 #899=(1,12,1,1)f32
pnnx.Attribute           effnet._blocks.7._se_expand 0 1 bias.33 @data=(288)f32 #bias.33=(288)f32
pnnx.Attribute           pnnx_unique_29           0 1 weight.77 @data=(288,12,1,1)f32 #weight.77=(288,12,1,1)f32
pnnx.Expression          pnnx_expr_1105           0 1 908 expr=[1,1]
pnnx.Expression          pnnx_expr_1103           0 1 909 expr=[0,0]
pnnx.Expression          pnnx_expr_1100           0 1 910 expr=[1,1]
pnnx.Expression          pnnx_expr_1099           0 1 2749 expr=1
F.conv2d                 F.conv2d_60              7 1 899 weight.77 bias.33 908 909 910 2749 x_squeezed.16 $input=899 $weight=weight.77 $bias=bias.33 $stride=908 $padding=909 $dilation=910 $groups=2749 #899=(1,12,1,1)f32 #weight.77=(288,12,1,1)f32 #bias.33=(288)f32 #x_squeezed.16=(1,288,1,1)f32
F.sigmoid                F.sigmoid_145            1 1 x_squeezed.16 913 $input=x_squeezed.16 #x_squeezed.16=(1,288,1,1)f32 #913=(1,288,1,1)f32
pnnx.Expression          pnnx_expr_1098           2 1 913 883 x0.16 expr=mul(@0,@1) #913=(1,288,1,1)f32 #883=(1,288,16,63)f32 #x0.16=(1,288,16,63)f32
pnnx.Expression          pnnx_expr_1097           0 1 917 expr=None
pnnx.Attribute           effnet._blocks.7._project_conv 0 1 weight.79 @data=(48,288,1,1)f32 #weight.79=(48,288,1,1)f32
pnnx.Expression          pnnx_expr_1093           0 1 923 expr=[1,1]
pnnx.Expression          pnnx_expr_1091           0 1 924 expr=[0,0]
pnnx.Expression          pnnx_expr_1088           0 1 925 expr=[1,1]
pnnx.Expression          pnnx_expr_1087           0 1 2759 expr=1
F.conv2d                 F.conv2d_61              7 1 x0.16 weight.79 917 923 924 925 2759 input.63 $input=x0.16 $weight=weight.79 $bias=917 $stride=923 $padding=924 $dilation=925 $groups=2759 #x0.16=(1,288,16,63)f32 #weight.79=(48,288,1,1)f32 #input.63=(1,48,16,63)f32
nn.BatchNorm2d           effnet._blocks.7._bn2    1 1 input.63 928 affine=True eps=1.000000e-03 num_features=48 @bias=(48)f32 @running_mean=(48)f32 @running_var=(48)f32 @weight=(48)f32 #input.63=(1,48,16,63)f32 #928=(1,48,16,63)f32
pnnx.Expression          pnnx_expr_1085           2 1 928 842 929 expr=add(@0,@1) #928=(1,48,16,63)f32 #842=(1,48,16,63)f32 #929=(1,48,16,63)f32
pnnx.Expression          pnnx_expr_1083           0 1 942 expr=None
pnnx.Attribute           effnet._blocks.8._expand_conv 0 1 weight.81 @data=(288,48,1,1)f32 #weight.81=(288,48,1,1)f32
pnnx.Expression          pnnx_expr_1079           0 1 948 expr=[1,1]
pnnx.Expression          pnnx_expr_1077           0 1 949 expr=[0,0]
pnnx.Expression          pnnx_expr_1074           0 1 950 expr=[1,1]
pnnx.Expression          pnnx_expr_1073           0 1 2770 expr=1
F.conv2d                 F.conv2d_62              7 1 929 weight.81 942 948 949 950 2770 input.65 $input=929 $weight=weight.81 $bias=942 $stride=948 $padding=949 $dilation=950 $groups=2770 #929=(1,48,16,63)f32 #weight.81=(288,48,1,1)f32 #input.65=(1,288,16,63)f32
nn.BatchNorm2d           effnet._blocks.8._bn0    1 1 input.65 953 affine=True eps=1.000000e-03 num_features=288 @bias=(288)f32 @running_mean=(288)f32 @running_var=(288)f32 @weight=(288)f32 #input.65=(1,288,16,63)f32 #953=(1,288,16,63)f32
nn.SiLU                  effnet._blocks.8._swish  1 1 953 954 #953=(1,288,16,63)f32 #954=(1,288,16,63)f32
pnnx.Expression          pnnx_expr_1072           0 1 957 expr=None
pnnx.Expression          pnnx_expr_1068           0 1 961 expr=288
pnnx.Attribute           effnet._blocks.8._depthwise_conv 0 1 weight.83 @data=(288,1,3,3)f32 #weight.83=(288,1,3,3)f32
nn.ZeroPad2d             effnet._blocks.8._depthwise_conv.static_padding 1 1 954 964 padding=(1,1,1,1) #954=(1,288,16,63)f32 #964=(1,288,18,65)f32
pnnx.Expression          pnnx_expr_1066           0 1 965 expr=[2,2]
pnnx.Expression          pnnx_expr_1064           0 1 966 expr=[0,0]
pnnx.Expression          pnnx_expr_1062           0 1 967 expr=[1,1]
F.conv2d                 F.conv2d_63              7 1 964 weight.83 957 965 966 967 961 input.67 $input=964 $weight=weight.83 $bias=957 $stride=965 $padding=966 $dilation=967 $groups=961 #964=(1,288,18,65)f32 #weight.83=(288,1,3,3)f32 #input.67=(1,288,8,32)f32
nn.BatchNorm2d           effnet._blocks.8._bn1    1 1 input.67 970 affine=True eps=1.000000e-03 num_features=288 @bias=(288)f32 @running_mean=(288)f32 @running_var=(288)f32 @weight=(288)f32 #input.67=(1,288,8,32)f32 #970=(1,288,8,32)f32
nn.SiLU                  pnnx_unique_30           1 1 970 971 #970=(1,288,8,32)f32 #971=(1,288,8,32)f32
pnnx.Expression          pnnx_expr_1060           0 1 972 expr=[1,1]
pnnx.Attribute           effnet._blocks.8._se_reduce 0 1 bias.35 @data=(12)f32 #bias.35=(12)f32
pnnx.Attribute           pnnx_unique_31           0 1 weight.85 @data=(12,288,1,1)f32 #weight.85=(12,288,1,1)f32
pnnx.Expression          pnnx_expr_1056           0 1 982 expr=[1,1]
pnnx.Expression          pnnx_expr_1054           0 1 983 expr=[0,0]
pnnx.Expression          pnnx_expr_1051           0 1 984 expr=[1,1]
pnnx.Expression          pnnx_expr_1050           0 1 2789 expr=1
F.adaptive_avg_pool2d    F.adaptive_avg_pool2d_8  2 1 971 972 x.21 $input=971 $output_size=972 #971=(1,288,8,32)f32 #x.21=(1,288,1,1)f32
F.conv2d                 F.conv2d_64              7 1 x.21 weight.85 bias.35 982 983 984 2789 input.69 $input=x.21 $weight=weight.85 $bias=bias.35 $stride=982 $padding=983 $dilation=984 $groups=2789 #x.21=(1,288,1,1)f32 #weight.85=(12,288,1,1)f32 #bias.35=(12)f32 #input.69=(1,12,1,1)f32
nn.SiLU                  pnnx_unique_32           1 1 input.69 987 #input.69=(1,12,1,1)f32 #987=(1,12,1,1)f32
pnnx.Attribute           effnet._blocks.8._se_expand 0 1 bias.37 @data=(288)f32 #bias.37=(288)f32
pnnx.Attribute           pnnx_unique_33           0 1 weight.87 @data=(288,12,1,1)f32 #weight.87=(288,12,1,1)f32
pnnx.Expression          pnnx_expr_1046           0 1 996 expr=[1,1]
pnnx.Expression          pnnx_expr_1044           0 1 997 expr=[0,0]
pnnx.Expression          pnnx_expr_1041           0 1 998 expr=[1,1]
pnnx.Expression          pnnx_expr_1040           0 1 2799 expr=1
F.conv2d                 F.conv2d_65              7 1 987 weight.87 bias.37 996 997 998 2799 x_squeezed.18 $input=987 $weight=weight.87 $bias=bias.37 $stride=996 $padding=997 $dilation=998 $groups=2799 #987=(1,12,1,1)f32 #weight.87=(288,12,1,1)f32 #bias.37=(288)f32 #x_squeezed.18=(1,288,1,1)f32
F.sigmoid                F.sigmoid_146            1 1 x_squeezed.18 1001 $input=x_squeezed.18 #x_squeezed.18=(1,288,1,1)f32 #1001=(1,288,1,1)f32
pnnx.Expression          pnnx_expr_1039           2 1 1001 971 x0.18 expr=mul(@0,@1) #1001=(1,288,1,1)f32 #971=(1,288,8,32)f32 #x0.18=(1,288,8,32)f32
pnnx.Expression          pnnx_expr_1038           0 1 1005 expr=None
pnnx.Attribute           effnet._blocks.8._project_conv 0 1 weight.89 @data=(88,288,1,1)f32 #weight.89=(88,288,1,1)f32
pnnx.Expression          pnnx_expr_1034           0 1 1011 expr=[1,1]
pnnx.Expression          pnnx_expr_1032           0 1 1012 expr=[0,0]
pnnx.Expression          pnnx_expr_1029           0 1 1013 expr=[1,1]
pnnx.Expression          pnnx_expr_1028           0 1 2809 expr=1
F.conv2d                 F.conv2d_66              7 1 x0.18 weight.89 1005 1011 1012 1013 2809 input.71 $input=x0.18 $weight=weight.89 $bias=1005 $stride=1011 $padding=1012 $dilation=1013 $groups=2809 #x0.18=(1,288,8,32)f32 #weight.89=(88,288,1,1)f32 #input.71=(1,88,8,32)f32
nn.BatchNorm2d           effnet._blocks.8._bn2    1 1 input.71 1016 affine=True eps=1.000000e-03 num_features=88 @bias=(88)f32 @running_mean=(88)f32 @running_var=(88)f32 @weight=(88)f32 #input.71=(1,88,8,32)f32 #1016=(1,88,8,32)f32
pnnx.Expression          pnnx_expr_1026           0 1 1029 expr=None
pnnx.Attribute           effnet._blocks.9._expand_conv 0 1 weight.91 @data=(528,88,1,1)f32 #weight.91=(528,88,1,1)f32
pnnx.Expression          pnnx_expr_1022           0 1 1035 expr=[1,1]
pnnx.Expression          pnnx_expr_1020           0 1 1036 expr=[0,0]
pnnx.Expression          pnnx_expr_1017           0 1 1037 expr=[1,1]
pnnx.Expression          pnnx_expr_1016           0 1 2819 expr=1
F.conv2d                 F.conv2d_67              7 1 1016 weight.91 1029 1035 1036 1037 2819 input.73 $input=1016 $weight=weight.91 $bias=1029 $stride=1035 $padding=1036 $dilation=1037 $groups=2819 #1016=(1,88,8,32)f32 #weight.91=(528,88,1,1)f32 #input.73=(1,528,8,32)f32
nn.BatchNorm2d           effnet._blocks.9._bn0    1 1 input.73 1040 affine=True eps=1.000000e-03 num_features=528 @bias=(528)f32 @running_mean=(528)f32 @running_var=(528)f32 @weight=(528)f32 #input.73=(1,528,8,32)f32 #1040=(1,528,8,32)f32
nn.SiLU                  effnet._blocks.9._swish  1 1 1040 1041 #1040=(1,528,8,32)f32 #1041=(1,528,8,32)f32
pnnx.Expression          pnnx_expr_1015           0 1 1044 expr=None
pnnx.Expression          pnnx_expr_1012           0 1 1047 expr=528
pnnx.Attribute           effnet._blocks.9._depthwise_conv 0 1 weight.93 @data=(528,1,3,3)f32 #weight.93=(528,1,3,3)f32
